[
  {
    "id": "5uvex6NizIfQMpOgBYDR",
    "title": "TESTING",
    "sport": "basketball",
    "level": "advanced",
    "duration": 60,
    "objectives": [],
    "sections": [],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "xpXL0YsVg8U12roUXqTK7rUS6fs1",
    "creatorName": "Lona Vincent (Coach)",
    "creatorEmail": "lv255@cornell.edu",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "videoUrl": "https://www.youtube.com/watch?v=AqvyzO3IPXc",
    "createdAt": "2025-10-21T00:50:10.000Z",
    "publishedAt": "2025-10-21T00:50:10.000Z",
    "updatedAt": "2025-10-21T00:50:10.000Z"
  },
  {
    "id": "APZmMOnoHtwFHMk0EPvy",
    "title": "Baseball: TEST",
    "sport": "baseball",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute TEST techniques with proper form and timing",
      "Apply TEST principles in competitive scenarios",
      "Understand the biomechanical foundations of TEST",
      "Integrate TEST into overall baseball strategy"
    ],
    "sections": [],
    "tags": [
      "baseball",
      "test",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "content": "# Baseball: TEST\n\n**Duration:** 45 minutes\n**Level:** Beginner\n**Focus:** Mastering TEST\n\n---\n\n## Learning Objectives\n\nBy the end of this session, you will be able to:\n- Execute TEST techniques with proper form and timing\n- Apply TEST principles in competitive game situations\n- Understand the biomechanical foundations of TEST\n- Integrate TEST seamlessly into your baseball strategy\n- Recognize and capitalize on opportunities to use TEST effectively\n\n---\n\n## Part 1: Warm-Up & Technical Foundation (10 minutes)\n\n### Movement Preparation\n\nStart with sport-specific movement patterns that activate the muscle groups essential for TEST. This isn't just about getting warm - it's about priming your neuromuscular system for the specific demands of TEST.\n\n**Dynamic Warm-Up Sequence:**\n\n- Shoulder rotation and arm circles - forward and back (1 min)\n- Rotational core activation - med ball twists (2 min)\n- Throwing mechanics review - long toss progression (3 min)\n- Footwork and agility drills (2 min)\n- Position-specific movements for TEST (2 min)\n\n### Technical Foundation Review\n\nBefore diving into advanced TEST execution, let's ensure your fundamentals are rock solid. the foundation is everything.\n\n**Core Principles:**\n1. **Body Positioning:** Proper stance, weight distribution, and alignment create the platform for success\n2. **Breathing Pattern:** Coordinated breathing with movement execution - exhale on exertion\n3. **Mental Focus:** Concentration points and awareness cues - where should your attention be?\n4. **Safety Protocols:** Injury prevention and proper progression - train smart, not just hard\n\n---\n\n## Part 2: Deep Dive - Mastering TEST (25 minutes)\n\n### The Setup Phase (Critical Foundation)\n\n**Batter's Box Setup:**\n- Set your stance in the batter's box - find your power position\n- Check grip on bat and hand positioning - relaxed but ready\n- Verify foot positioning and weight distribution - balanced and athletic\n- Ensure proper eye tracking on pitcher - see the ball early\n- Mental preparation - know the count, know the situation, know the pitcher's tendencies\n- Timing mechanism ready - your trigger to start the swing\n\nHitting is about rhythm and timing. Find yours and trust it.\n\nThis setup phase is non-negotiable. Rush it, and everything that follows will be compromised. Take your time here.\n\n### Initial Movement & Positioning\n\n**Stance & Setup Mechanics:**\nSet your stance in the batter's box with feet slightly wider than shoulder-width, weight balanced 50-50 or slightly back (60-40) depending on your swing preference. For TEST, your grip pressure should be firm but relaxed - think \"holding a bird\" - with the bat resting in your fingers, not your palms. Your back elbow should be raised to approximately shoulder height, creating the proper bat path angle. Your head must be perfectly level, eyes tracking the pitcher's release point. Before the pitch: identify the pitcher's grip (fastball vs. off-speed), anticipate pitch location based on count and situation, and commit mentally to your swing decision point. Your front shoulder should be closed slightly toward the pitcher, creating torque for the swing. Timing mechanism: use a small forward press or leg kick to sync your movement with the pitcher's delivery. This rhythm is crucial for TEST execution.\n\n### Reading the Situation & Timing Your Execution\n\nThe transition to TEST requires reading the situation and timing your execution perfectly.\n\n### Force Application & Execution\n\nGenerate power through rotational mechanics - legs drive hips, hips rotate torso, torso whips arms/bat. The chain must be fluid and connected. Break one link, lose all power.\n\nYour body should move as one coordinated unit. Power comes from the ground up - legs drive hips, hips drive core, core transfers energy to your point of contact.\n\n### Follow-Through & Finish\n\nFollow through with complete extension and balance. Don't stop the swing/throw early. Full range of motion equals full power and accuracy.\n\nNever stop halfway. Complete every rep with full commitment to the movement pattern.\n\n### Common Mistakes & Corrections\n\nI've seen these mistakes hundreds of times. Let's make sure you avoid them:\n\n**Mistake #1:** Dropping hands or collapsing back elbow\n**Fix:** Keep hands high, maintain bat path angle\n\n**Mistake #2:** Overstriding or poor weight transfer\n**Fix:** Controlled stride, weight stays back until commitment\n\n**Mistake #3:** Taking eyes off the ball\n**Fix:** See it hit the bat - literally track it all the way\n\nThe difference between good and great athletes is attention to these details. Good athletes know what to do. Great athletes know what NOT to do.\n\n\n\n### Advanced Variations for Beginner Athletes\n\n**Speed & Timing Variation:** Execute TEST with increased tempo and sharper timing. This variation focuses on quick recognition and instant execution. Use this when opponents are slower to react or when you have a speed advantage. Key: maintain technique even as speed increases.\n\n**Power & Precision Variation:** Execute TEST with emphasis on maximum force and pinpoint accuracy. This variation sacrifices some speed for devastating effectiveness. Use this when you have position advantage or when one perfect rep is better than multiple good ones. Key: quality of execution over quantity of attempts.\n\n### Tactical Applications in Competition\n\nUnderstanding the technique is one thing. Knowing WHEN to use it is what separates athletes who win from athletes who just train.\n\n**Offensive Opportunities:**\nUse TEST when you recognize opponent vulnerability or situational opportunity. Look for: defensive overcommitment, positional advantages, timing windows, or pattern breaks. The best offense is opportunistic - recognize and capitalize instantly.\n\n**Defensive Considerations:**\nWhile executing TEST, maintain awareness of counter-attacks and defensive responsibilities. Every offensive action creates defensive vulnerability. Know what you're exposing and be ready to defend it. Attack smart, not reckless.\n\n**Transition Opportunities:**\nTEST should flow seamlessly into your next action. Chain techniques together - if this works, what's next? If they defend, what's my counter? Think three moves ahead. The technique is just one link in the chain.\n\n---\n\n## Part 3: Practice & Application (8 minutes)\n\n### Progressive Drilling Sequence\n\n**Practice Progression:**\n\n1. Technical reps with zero resistance - learn the pattern\n2. Add progressive resistance - build under pressure\n3. Live application - execute in chaos\n\nThis is how champions are built.\n\n### Live Competition Simulation\n\nNow we take everything we've learned and apply it under pressure. This is where champions are made.\n\n- Practice TEST with time constraints and fatigue\n- Execute against multiple opponent styles/situations\n- Make real-time decisions about when to use TEST\n- Manage your energy and maintain technique quality under stress\n\nThe drill is the teacher. The game is the test. Train like you compete, compete like you train.\n\n---\n\n## Cool-Down & Integration (2 minutes)\n\n### Key Takeaways - What to Remember\n\nYour brain can only hold so much. Here are the three things I want you to remember from today:\n\n1. **Primary Execution Cue:** Setup first, then execute - never rush the foundation of TEST\n2. **Most Common Mistake:** Rushing the technique instead of trusting the process\n3. **Best Opportunity Signal:** When you see the opening clearly and your body position is optimal - that's your moment\n\n### Cool-Down Protocol\n\n- Light stretching focusing on muscle groups used in TEST\n- Breathing exercises for recovery (4-7-8 breathing pattern)\n- Mental reflection: What felt good? What needs work?\n- Hydration and nutrition within 30 minutes\n\n### Practice Homework\n\nHere's what I want you to work on before we meet again:\n\n**Daily Practice (10 minutes):**\n- 10 perfect repetitions of TEST setup phase - focus on quality, not speed\n- Visualize TEST execution in 3 different game scenarios\n- Watch video examples if available and identify the key moments\n\n**Mental Preparation:**\n- Before bed, mentally rehearse TEST execution 5 times\n- See yourself succeeding, feel the movement, hear the sounds\n- This mental practice is as important as physical reps\n\n**Journal Prompt:**\nWrite down: \"The one thing that clicked for me today about TEST was...\"\n\n\n\n---\n\n## Coach Notes & Adaptations\n\n**Safety Reminders:**\n- Monitor athletes for signs of fatigue - technique breaks down when tired\n- Ensure proper hydration throughout session\n- Watch for overexertion during live practice - ego can override good judgment\n\n**Individual Adaptations:**\n- Modify TEST technique for different body types and athletic backgrounds\n- Adjust intensity based on experience level - push, don't break\n- Provide additional support for struggling athletes - everyone learns at their own pace\n\n**Assessment Criteria:**\n- Technical execution accuracy (form first, speed second)\n- Understanding of application principles (when to use it)\n- Ability to adapt under pressure (can they adjust mid-execution?)\n- Safety awareness and control (always)\n\n---\n\n**Final Word:**\n\nTEST is not just a technique - it's a weapon you add to your arsenal. Master it through deliberate practice, understand it through competition, and refine it through constant feedback.\n\nRemember: Perfect practice makes perfect. See you at the next session.\n\n---\n\n*This lesson plan provides a comprehensive framework for mastering TEST in baseball. Adjust timing and intensity based on individual needs and facility constraints. The goal is not just to teach the technique, but to develop athletes who think, adapt, and excel under pressure.*\n",
    "videoUrl": "https://firebasestorage.googleapis.com/v0/b/gameplan-787a2.firebasestorage.app/o/lesson-videos%2FOQuvoho6w3NC9QTBLFSoIK7A2RQ2%2F1761081621877_test_.mp4?alt=media&token=e2d66e4b-4dbe-4bc5-bcbf-9a48182d8980",
    "createdAt": "2025-10-21T21:20:46.000Z",
    "publishedAt": "2025-10-21T21:20:46.000Z",
    "updatedAt": "2025-10-21T21:20:46.000Z"
  },
  {
    "id": "EFipOkolaGGMd67tT6kf",
    "title": "Cross Collar Choke",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760084749772",
        "title": " Cross Collar Choke from Closed Guard (fundamental gi choke)",
        "type": "text",
        "content": "Goal: Secure two deep collar grips and use torque and body mechanics to create a high-percentage choke from closed guard.\n\nWhy we train it\n\nThe cross collar choke is a core submission in gi Jiu Jitsu. It teaches grip fighting, posture breaking, and subtle body mechanics rather than brute strength.\n\nStep-by-step mechanics\n\nInitial grips and posture break\n\nFrom closed guard, control one sleeve or the back of the wrist with one hand to prevent posture.\n\nBreak posture with hip drive, pulling them forward with feet on hips or one foot on the hip and the other hooking the hip.\n\nEstablish the first collar grip\n\nWith your dominant hand, reach deep into the opponent’s collar on the far side. Your thumb should be tucked in and the blade of your hand inside the collar, palm toward you.\n\nPull the collar across their neck to flatten them.\n\nSet the second grip (crossing hand)\n\nWith your other hand, reach under and grab the opposite collar, again deep, so the fingers can pull the collar across. The grips should form an X across the neck when both are pulled.\n\nYour elbows should be low and close to your ribs so the chokepath is horizontal across the carotid arteries.\n\nFinish mechanics\n\nSqueeze and rotate your torso while pulling both hands in opposite directions. Use your shoulders and back, not biceps.\n\nFor added leverage, expand your guard slightly and use your shin to push on their ribs or hip to prevent their bridge escape.\n\nOptionally, sit up slightly and use your legs to rotate their head for a quicker finish.\n\nVariations and set-ups\n\nCross collar to armbar: If they posture and defend the choke, switch to an armbar by isolating the wrist and swinging the leg over.\n\nCross collar with hip bump sweep: Break posture, set collar, bump to side sweep as they react, and tighten choke once on top.\n\nDrills and repetitions\n\nGrip entry drill: 5 slow reps where you focus only on deep collar grips, no finish.\n\nTiming drill: Partner resists posture; you break and immediately set cross-collar, 6 reps each side.\n\nLive guard rounds: Start with closed guard and attempt cross collar or transitions for 3-minute rounds.\n\nCommon mistakes and corrections\n\nShallow grips: Collar must be deep. Correction: slide your hand as far up the collar as possible with thumb in.\n\nUsing arms only: The finish should use torso rotation. Correction: rotate chest and pull with shoulder blades.\n\nLeaving elbows high: This creates space. Correction: keep elbows tight and hug the opponent’s upper chest.\n\nCoaching cues\n\n“Two deep grips, elbows in, rotate your chest.”\n\n“Pull collar to collar, don’t yank with your biceps.”\n\n“Use your hips to break posture before you take the grips.”\n\nSafety and training hygiene\n\nTap early; when partner taps, release immediately.\n\nDrill the finish slowly at first. Build speed only after the grip pathways are automatic.\n\nWarm up ankles, knees, and neck before drilling takedowns and chokes.\n\nFor chokes, practice from the bottom and top so both partners understand the feeling and when to tap.\n\nSuggested week plan (how to train these)\n\nDay 1: Warm-up, 20 minutes drilling single leg entries and finishes, 20 minutes positional sparring (standing entries) and 10 minutes cool down.\n\nDay 2: Warm-up, 25 minutes leg drag sequences and passing, 20 minutes situational rolling starting in guard, finish with 10 minutes technique review.\n\nDay 3: Warm-up, 30 minutes cross collar grip drills and finishing, 20 minutes live guard rounds with focus on submissions, short mobility cool down.",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T08:26:15.000Z",
    "publishedAt": "2025-10-10T08:26:15.000Z",
    "updatedAt": "2025-10-10T08:26:15.000Z"
  },
  {
    "id": "EMpb62YS2Ra3hH6VYMYX",
    "title": "Ankle locks",
    "sport": "bjj",
    "level": "advanced",
    "duration": 60,
    "objectives": [],
    "sections": [],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "content": "Ankle locks are dangerous ",
    "videoUrl": "https://firebasestorage.googleapis.com/v0/b/gameplan-787a2.firebasestorage.app/o/lesson-videos%2FOQuvoho6w3NC9QTBLFSoIK7A2RQ2%2F1761178446876_78287115575__72DCE561-6327-41C7-BE74-0F4A27A0FAE6.MOV?alt=media&token=686149de-fbdd-457f-8605-72e5287544a3",
    "createdAt": "2025-10-23T00:14:55.000Z",
    "publishedAt": "2025-10-23T00:14:55.000Z",
    "updatedAt": "2025-10-23T00:14:55.000Z"
  },
  {
    "id": "HlHR2I89KHF4bunGQIMq",
    "title": "history of the omoplata",
    "sport": "bjj",
    "level": "advanced",
    "duration": 60,
    "objectives": [
      "omoplata"
    ],
    "sections": [
      {
        "id": "section-1760340269849",
        "title": "The omaplata ",
        "type": "text",
        "content": "Title\n\nOmaplata: A Practical Guide, History, and Uses\n\nIntroduction\n\nThe omaplata is a versatile shoulder lock used in Brazilian Jiu-Jitsu and other grappling arts. It combines limb control, hip mobility, and timing to create a submission that can also serve as a sweep or transition. This guide is written for practitioners at all levels who want a thorough, readable lesson on the omaplata, its history, technique variations, training drills, competitive applications, common mistakes, counters, and safety considerations.\n\nWhat the omaplata is\n\nAt its core, the omaplata is a figure-four style shoulder lock executed with the legs. The practitioner traps an opponent's arm with their legs and rotates their hips to torque the shoulder joint by isolating the upper arm and applying pressure through hip movement and body positioning. Though it is often taught as a submission from guard, it can arise from many positions including open guard, butterfly guard, half guard, and even from top positions when a roll or scramble occurs.\n\nBrief history\n\nThe omaplata has roots in traditional Judo and submission wrestling. Early forms of leg-applied shoulder locks appear in older grappling arts where practitioners explored using the legs to control arms and shoulders. Brazilian Jiu-Jitsu adopted and refined many techniques from Judo and catch wrestling during the development of its modern curriculum. The name omaplata is Portuguese in origin, reflecting BJJ's Brazilian history, and it gained wider popularity as practitioners discovered its utility in both gi and no-gi contexts. Over time it moved from a relatively obscure control to a widely recognized weapon because of its ability to produce both submissions and advantageous scrambles.\n\nPrinciples and mechanics\n\nSuccessful omaplata execution depends on several mechanical principles. First, control of the wrist or sleeve is critical to prevent the opponent from withdrawing the arm. Second, hip mobility and rotation create the torque necessary to stress the shoulder. Third, leg placement across the opponent's back and over the shoulder acts as the primary clamp that holds the arm in place. Fourth, controlling the opponent's posture limits their ability to stack or roll out. Finally, timing and sequencing matter: you rarely force an omaplata into existence; you create it by removing safe options from your opponent and inviting the angle that makes the shoulder vulnerable.\n\nCommon entries\n\nThere are multiple reliable entries to the omaplata. Classic entries include the closed guard sleeve drag entry, where the practitioner uses a sleeve grip to pull the arm across and then swings the leg over the shoulder. Open guard entries involve underhooks and leg threads that trap the arm against the torso before rotating the hips. The butterfly guard can create elevation and angles to slip a shin over the shoulder. Another common moment is during scrambles when an opponent leaves an arm extended or posts in a way that makes it susceptible to being threaded and trapped.\n\nStep-by-step basic omaplata from closed guard\n\n1. Secure grips: From closed guard, obtain a grip on the opponent's sleeve or wrist with the same side hand while controlling the collar or head with your other hand to limit posture.\n2. Create the angle: Open your guard and pivot your hips toward the arm you intend to attack. Bring your leg on the same side up and over the opponent's shoulder, aiming to place your shin across their upper back or shoulder.\n3. Clamp the arm: Slide your leg across so their arm becomes trapped between your hips and legs. Keep contact and maintain control of the wrist to prevent withdrawal.\n4. Rotate the hips: Turn your body away from the trapped arm, scooting your hips under their shoulder and changing the angle so that the shoulder joint becomes exposed to torque.\n5. Finish or transition: To finish the shoulder lock, sit up or lean your weight forward while driving your hips into the shoulder and pulling the trapped arm across their back. Alternatively, if they posture or roll, use the momentum to sweep them or take the back.\n\nDetails to emphasize include keeping the knee tight to their side, preventing their free arm from posting, and using your free leg to control posture or block escape routes.\n\nVariations and setups\n\nSeveral variations expand the omaplata's usefulness. In gi, sleeve grips and collar grips can be used to immobilize the arm and pin the opponent's torso. No-gi versions rely on wrist control and body hooks. The kneebar-like omaplata-to-kneebar sequence appears when an opponent rolls and exposes their leg. Another variation uses the omaplata as a trap: instead of finishing the shoulder lock directly, the practitioner threatens it and forces a roll that leads to a sweep or back take. There is also an inversion-style omaplata used by flexible practitioners where the attacker inverts to secure a deeper clamp and follow rolls into leg attacks. Each variation requires subtle adjustments to leg placement and timing.\n\nFinishing mechanics and pressure\n\nFinishing an omaplata properly requires a mix of hip movement, torso control, and leverage. Drive the hips forward into the opponent's shoulder while pulling the wrist toward your body. Elevating their elbow slightly while keeping the hand controlled increases the shoulder's internal stress. Sitting up can amplify the pressure but may also allow space for the opponent to roll. A quieter finish often involves slowly tightening the clamp with the legs while increasing hip pressure. In no-gi competitions controlled, systematic pressure is often more reliable than dramatic sit-ups because friction from the gi is absent and opponents can slip free quicker.\n\nCommon mistakes and how to fix them\n\nMany practitioners make similar errors when learning the omaplata. One common mistake is failing to control the wrist, which allows the opponent to pull the arm out. The fix is to establish a secure wrist or sleeve grip before committing the leg. Another error is poor hip rotation. Without turning away from the trapped arm, the shoulder will not be exposed to sufficient torque. Drilling hip mobility and practicing the pivot without an opponent helps. Leaving space with the legs can let the opponent slip their arm free or stack you. Keep your legs connected and practice clamping drills. Overcommitting to a sit-up finish can give the opponent space to roll. Drill controlled finishes and study timing when opponents react.\n\nDrills and progressions\n\nA structured drill progression builds reliable omaplata entries and finishes. Start with positional awareness drills where you practice hip rotation while an unwilling partner provides light resistance. Next, drill the grip and leg placement repeatedly from closed and open guard. Add resistance gradually, practicing the sequence from control to clamp to hip rotation. Specific partner drills include the arm-trap flow where the partner tries to withdraw the arm and the defender counters by keeping the grip and adjusting the leg position. Another useful drill is the 'follow-the-roll' drill where the attacker practices following the defender if they roll in an escape attempt, converting that roll into a back take.\n\nNo-gi considerations\n\nIn no-gi, the lack of sleeve and collar grips changes the dynamics. Wrist control, underhooks, and body hooks become more important. Leg entanglements and hooking the thigh can help secure the arm. Since grips are less secure, timing becomes even more crucial. Quick, tight transitions and using your legs as clamps are necessary to prevent the arm from slipping free. Also consider chaining attacks so that if the omaplata fails, you can move to a kneebar, triangle, or back take. Training specific no-gi entries and finishes will reduce dependency on cloth grips and improve your ability to finish under slippery conditions.\n\nGi-specific techniques\n\nThe gi offers additional control options, which makes some omaplata entries more reliable. Using a sleeve grip and a cross-collar grip pins the opponent and slows their movement. You can use the gi to lace the wrist or loop your hand under their wrist using the fabric to prevent withdrawal. In gi competition, omaplatas can be disguised with grips that look like guard retention but suddenly become submission attempts. The gi's friction also rewards slower, more technical finishes that rely on incremental tightening instead of explosive force.\n\nChains and sequences\n\nThe omaplata fits into broader attack chains. A classic chain is triangle to armbar to omaplata. If the opponent defends a triangle by straightening an arm, an omaplata entry can appear. Another chain is creating the omaplata threat and transitioning to a sweep or back take if the opponent rolls. The omaplata can also lead to leg attacks if the opponent reacts with a roll that exposes a leg. High-level grapplers link the omaplata to knee bars and heel hooks in submission-only events by using the opponent's roll to open access to the hips and legs.\n\nCompetition application\n\nIn sport BJJ the omaplata can be high risk and high reward. In gi competition where points are at stake, a well-timed omaplata that results in a sweep can be more valuable than the submission attempt alone. In submission-only formats, athletes favor aggressive omaplata attempts that either finish or force scrambles leading to other submissions. Understanding the scoring system informs your approach: if you need points, prioritize securing the sweep; if you need a submission, commit to finishing while maintaining follow-up options in case the finish fails.\n\nFamous examples\n\nSeveral high level grapplers have used omaplatas effectively in competition. Their sequences often demonstrate the technique's versatility and the importance of chaining. Watching matches from skilled BJJ competitors can reveal subtle entries and control methods that are hard to replicate in isolated drills. Study footage where omaplatas lead to back takes or sweeps to understand the decision making behind committing to the move. Analyzing these examples helps practitioners recognize the right moments to attempt the omaplata and how to react when defenders counter.\n\nSafety and tap culture\n\nThe omaplata targets the shoulder joint and can injure the rotator cuff, labrum, or shoulder ligaments if applied forcefully without warning. In training, communicate with partners and tap early when pressure is applied. As an attacker, apply slow, controlled pressure as your partner adjusts. Keep training safe by practicing with graduated resistance; start with cooperative drilling before adding resistance. If training with less experienced partners, prioritize positional control and avoid sudden forceful finishes.\n\nTeaching tips for coaches\n\nWhen teaching the omaplata, break the technique into small, repeatable steps. Emphasize wrist control, hip rotation, and leg placement. Use slow-motion demonstrations and have students drill solo hip movements before pairing up. Encourage drilling from both sides and include escape and counter drills so students understand the full lifecycle of the position. Correct common mistakes with targeted exercises: wrist retention drills for grip errors, hip mobility drills for rotation problems, and posture control exercises for preventing stacking.\n\nCommon counters and defenses\n\nOpponents have several effective counters. With good wrist control, they can pull the arm free and posture out. To prevent this, control the wrist early and use your body to block the escape. Another common defense is stacking the attacker to flatten the legs and reduce leverage. Counter the stack by maintaining leg tightness and by using the rollback to take the back if they commit to stacking. Rolling toward the trapped arm can also relieve pressure; anticipate the roll and transition to a sweep or back take before they fully relieve the shoulder torque.\n\nTransition opportunities\n\nIf the omaplata fails as a submission, it often creates transition opportunities. A committed defender who rolls to avoid the shoulder lock may expose their back. The attacker can then follow the roll and take the back with hooks. If the opponent postures and attempts to stand, the attacker can use leg hooks to sweep or transition into a kneebar if their legs are in position to attack the lower limbs. Practicing these transitions increases the move's value because it becomes part of a multi-option attack rather than a single attempt.\n\nIntegrating into your game plan\n\nDecide when the omaplata best fits your style. If you have good hip mobility and flexibility, the omaplata may be a strong weapon for you. If you prefer aggressive top control, you might use it as a surprise counter during scrambles. Train specific entries that fit your favorite guards and spend time drilling escapes and counters so you can commit to the move during rolling. Pair the omaplata practice with complementary techniques such as triangle chokes, armbars, and leg locks so you can flow between options seamlessly.\n\nProgramming training sessions\n\nA focused class on the omaplata can be productive in a 45 to 75 minute session. Start with a warm-up emphasizing hip movement and mobility. Move to technical drilling for 15 to 25 minutes covering entries from closed guard, open guard, and butterfly guard. Include cooperative positional sparring where the attacker works only on entries and the defender resists lightly. Add transition drills to teach what to do after the omaplata is threatened. Finish with situational rolling where one partner starts in the omaplata position and the other tries to escape or counter for a short round.\n\nTroubleshooting progress\n\nIf you struggle to land the omaplata, self-check these areas. Are you establishing wrist control early? Is your hip rotation tight and decisive? Are you giving away space with your legs? Address each area in isolation through targeted drills. Record training sessions to study your angles. Ask a coach to watch and correct small positional adjustments; often a centimeter of foot placement or a degree of hip rotation makes the difference. Stay patient and persistent because the omaplata is a technique that rewards repetition and small refinements.\n\nDetailed history and lineage\n\nTracing the omaplata's history requires looking at how grappling arts borrowed from one another as techniques evolved. Many modern submissions have roots in older systems where practitioners experimented with limb control using legs. Classic Japanese judo and sambo contain entries that use the legs to control an opponent's arm and shoulder. As practitioners in Brazil adapted and refined these techniques during the early development of Brazilian Jiu-Jitsu, they explored new ways to clamp and torque joints with the lower body. Over time the omaplata became more defined within BJJ curricula and instructional content, and its use spread as competitors and coaches discovered its value as both a threat and a transition tool.\n\nBiomechanics of the shoulder lock\n\nUnderstanding the biomechanics helps you apply the omaplata safely and effectively. The shoulder is a ball-and-socket joint with a wide range of motion. This mobility comes at the cost of stability, which is provided by soft tissue structures including the rotator cuff muscles, the labrum, and the shoulder ligaments. The omaplata creates a rotational force across the humeral head and shoulder socket by externally rotating and abducting the arm while fixation points at the wrist and elbow prevent natural motion. Proper application uses gradual torque and the body as leverage rather than brute force so that training partners can safely explore the movement without risk of sudden injury.\n\nAnatomical cues and safety details\n\nWhen you practice the omaplata, watch for early signs of shoulder discomfort. If your partner reports sharp pain near the front of the shoulder or a catching sensation, release immediately. As the attacker, you should focus on mechanical leverage rather than brute strength. Use your hips to create space and torque slowly. Keep a secure wrist or sleeve control but avoid sudden yanks when testing the submission with a resisting partner. Teaching environments should emphasize that the omaplata is a joint lock and requires mutual respect and clear communication to train safely.\n\nEntries from different guards in depth\n\nClosed guard entry: The classic entry begins with a sleeve or wrist control and a near-side pivot. The attacker breaks the posture with a collar or head control and steps a foot to the mat. From there the attacker swings the far-side leg up and over the opponent's shoulder. The shin should settle across the upper back, and the knee should be close to the opponent's side. Establishing the leg clamp requires adjusting the hips so the ankle can come across the opponent's ribs or back and the foot can hook behind the shoulder to prevent escape.\n\nButterfly and open guard entries: With butterfly guard you use your hooks to elevate and manipulate balance. Timing a lift or hook under their thigh while threading the arm can force the opponent to post or open their arm. Use a butterfly hook to change the opponent's base and slip the shin over the shoulder. In open guard the attacker often uses an underhook and leg weave, or a specific thread where the knee comes across the upper arm, creating a pocket for the shin to rest on the shoulder blade.\n\nHalf guard and scramble entries: A dynamic entry occurs during scrambles. If you are on top in half guard and the opponent leaves an arm extended or attempts an underhook, you can be vulnerable to an omaplata if you do not retract the arm quickly. Likewise, when you are in half guard and attempt to isolate an arm, you can set up an omaplata by rotating your hips and threading the leg across the arm during the transition to sweep.\n\nDetailed step-by-step with technical cues\n\nThis expanded technical sequence is meant for fine-tuning. Assume you are starting in closed guard. 1) Grip selection: Grip the opponent's sleeve at the wrist with your right hand if you plan to attack their right arm. Use your left hand on the collar or behind the head to break posture. Call out a verbal cue to your partner so they know the stage of the drill. 2) Angle creation: Place your left foot on the mat and shift your hips to the right while pulling their right arm across their body. Your movement should make their elbow rotate away from their ribs, exposing the shoulder angle. 3) Leg swing: Bring your right leg up and over their shoulder. Try to land your shin flat across their upper back with your ankle near their ribs. 4) Lock the limb: Pull the wrist toward your chest while your legs clamp the upper arm. Use your left foot to block their posture or push down on their hip to keep them from stacking. 5) Hip rotation and finish: Rotate your hips away from the trapped arm, then apply forward hip pressure while maintaining the wrist pull. Small adjustments to the knee and ankle can increase the effectiveness without large movements that allow escapes.\n\nAdvanced control details\n\nUse your free leg to control the opponent's posture. For example, placing a foot on their hip or across their face can prevent them from posturing or stacking. Splay your knees to create a secure clamping base. When you bring their hand across their back, pull their elbow in while keeping their wrist pinned. Sometimes a foot across the back of their head or a calf hook behind their ribs helps lock their upper body so the omaplata becomes a tighter submission. Another refined detail is to use your foot to control their near-side leg to limit their ability to step and roll.\n\nChain drills and flow sequences\n\nTo build fluency, set up chain drills that keep the partner moving through options. Example flow: triangle attempt leads to armbar attempt leads to omaplata. If you fail the triangle because the opponent postures, release the triangle attempt and switch your leg position into an omaplata setup. If the omaplata fails because they roll, follow the roll to the back and secure hooks. Repeat this flow with incremental resistance until the sequences become instinctive. Another helpful flow is omaplata threat into sweep, then pass to mount if the defender posts incorrectly.\n\nSample 8-week training plan\n\nWeek 1: Mobility and basic mechanics. Focus on hip mobility, solo pivots, and basic leg positioning. Drill solo hip pivots and light partner entries.\nWeek 2: Closed guard entries and wrist control. Add cooperative repetitions with a focus on timing and grip strength.\nWeek 3: Open and butterfly setups. Practice elevation and leg threading from different angles.\nWeek 4: No-gi adaptations. Train without sleeves and practice wrist control under light resistance.\nWeek 5: Chains and transitions. Combine omaplata with triangle and armbar sequences and practice following rolls.\nWeek 6: Resistance and counters. Add full resistance in situational sparring and drill counters and escapes.\nWeek 7: Competition simulation. Practice timed attempts with scoring and decision-making emphasis.\nWeek 8: Refinement and testing. Review weaknesses, tune details, and run situational sparring sessions focusing on instant reaction and chaining.\n\nTen partner drills with steps\n\n1. Hip pivot solo drill: Lie on your back and practice pivoting your hips without a partner. Repeat 50 reps per side.\n2. Wrist retention drill: Partner attempts to pull wrist free while you maintain grips and reposition your leg. Repeat sets of 20 seconds each.\n3. Slow entry drill: From closed guard, move through the entire sequence slowly with an unresisting partner, focusing on smooth leg movement. Repeat 10 times each side.\n4. Resistance entry drill: Same as slow entry but partner resists mildly to create realistic pressure. Do 3 rounds of 3 minutes each.\n5. Roll and follow: Partner rolls to try to escape. Attacker follows the roll and practices taking the back. Repeat for 10 rolls.\n6. Stack escape drill: Partner stacks to flatten. Practice rollback and back take transitions. 8 reps.\n7. No-gi grip drill: Practice omaplata entries without garments. Focus on wrist control and quick leg clamp. 12 reps.\n8. Chain drill: Triangle to armbar to omaplata sequence on one side, then the other. 5 sequences each side.\n9. Flow sparring: Start from closed guard with the attacker allowed only omaplata attempts for 3 minutes. Switch roles.\n10. Realistic scramble drill: Start standing, drop to guard, and allow natural scrambles where omaplata opportunities might appear. 10 rounds.\n\nCommon counters explained and counter-counters\n\nWhen the defender postures to pull the arm, the attacker should be ready to switch to an armbar or triangle. If the defender stacks to reduce leverage, the attacker can use a rollback to sweep or transition to the back. If the defender rolls toward the trapped arm, the attacker should anticipate and follow the roll to secure back control. If the defender pulls the wrist free, the attacker must either recover a grip immediately or change the attack to a leg or hip sweep. Practicing these counter-counters in a controlled setting makes them instinctual under pressure.\n\nTeaching cues and language to use\n\nKeep coaching language precise. Use cues like \"lock the wrist,\" \"swing the shin,\" \"hips away,\" and \"stay tight\" to guide students. Avoid overly technical language for beginners. Ask specific questions like \"Can you feel your shin on their shoulder?\" or \"Is their elbow pinned to your hip?\" These questions help the student internalize the correct positions and feel the difference between correct and incorrect setups.\n\nIntegrating omaplata with other grappling arts\n\nThe omaplata's principles apply outside BJJ. In submission wrestling, the lack of the gi demands faster entries but rewards mobility and chain attacks. In MMA the omaplata is rarer because strikes can change the calculus and people are less likely to expose the arm, yet it can still appear during clinch transitions or scramble moments. Training the omaplata with awareness about strikes requires additional safety and strategy; for example, in MMA you might use the omaplata to secure a dominant position rather than to commit to a finish that exposes you to strikes.\n\nQ and A: Troubleshooting common issues\n\nQ: I can get the leg over but the opponent always pulls their arm out. What am I missing?\nA: This often means your wrist control is weak or the angle is wrong. Work on a solid grip and bring your hip in closer so your thigh presses against their triceps. Use your free hand to control their elbow or post on their shoulder to block withdrawal.\n\nQ: When I sit up to finish I lose control and they roll out. How do I finish without creating space?\nA: Try a slow, measured finish rather than an explosive sit up. Instead of sitting all the way up, curl your torso and drive your hips into their shoulder while tightening the lock with your legs. Consider sliding your body weight in the direction of their trapped arm to direct the torque. Also remember to keep their elbow from dropping; a tucked elbow makes the lock easier to hold.\n\nNotable practitioners and match study ideas\n\nLearning from high level competitors will improve nuance. Watch matches and instructional content from athletes known for creative guard work. Study how practitioners disguise the omaplata in their guard play and how they follow failed submissions into sweeps and back takes. Pay attention to the small adjustments these athletes make when opponents stack or posture. Use match study sessions as part of your training: pick a match clip, identify moments where an omaplata appears or could have been applied, and then drill those moments at light speed.\n\nClass handout: one-page summary\n\nTitle: Omaplata Quick Reference\n\n1. Goal: Trap the arm and torque the shoulder with your hips and legs.\n2. Key grips: wrist, sleeve, collar or head control.\n3. Hip cue: rotate away from the trapped arm, tuck your hip under the shoulder.\n4. Leg cue: shin across upper back, ankle near ribs, clamp tight.\n5. Finish cues: drive hips forward, pull wrist, keep elbow up.\n6. Safety: apply slowly, tap early, avoid sudden yanks.\n7. Drill: 10 slow reps each side, 5 progressive partners.\n\nGlossary and terms to know\n\nomaplata: A shoulder lock applied with the legs. Originates in grappling arts and named in Portuguese in the Brazilian context.\nguard: Position where the practitioner on their back uses their legs to control the opponent.\nposture: The opponent's upright alignment when in another player's guard.\nstack: A defensive tactic where the opponent pushes forward and onto the attacker to reduce leverage.\nspin-through: A transition where the attacker rotates to follow an opponent's roll, commonly to take the back.\nrolling: A common training method where the attacker and defender scramble to practice transitions and counters.\n\nSuggested resources for deeper study\n\nBooks: Look for texts on Brazilian Jiu-Jitsu technique and submission grappling that include leg-applied submissions and guard networks. Instructionals: Seek out focused instructional videos from experienced instructors who teach control and transitions more than brute finishing. Drilling partners: Rotate partners frequently to experience different body shapes and reactions so you learn how the omaplata behaves against varied defenses.\n\nCompetition rule considerations\n\nKnow your rules. Some modern submission grappling events have restrictions on certain leg attacks or on attacks that involve spinning under the body. While the omaplata is generally legal, certain transitions that expose the knee or involve twisting leg locks may fall into restricted categories in some promotions. Always check the competition rules before practicing specialized sequences that chain to restricted attacks for that rule set.\n\nSample situational sparring templates\n\nTemplate A: Attacker starts in closed guard and has 2 minutes to attempt an omaplata. Defender's goal is to avoid submission and pass guard. Switch roles.\nTemplate B: Attacker may only start from butterfly guard, defend with light resistance for the first 30 seconds, then increase resistance.\nTemplate C: No-gi situational where the attacker must enter the omaplata without sleeve grips and finish or transition within 90 seconds. These templates help train realistic timing and decision making.\n\nFinal practice checklist for coaches and students\n\n1. Warm up with hip mobility and shoulder readying movements.\n2. Review safety and tapping protocols.\n3. Practice solo pivots and leg swings for 10 minutes.\n4. Do controlled partner entries at slow speed for 15 minutes.\n5. Add light resistance and flow chains for 15 minutes.\n6. Finish with situational sparring and cool down. Keep notes on which entries worked and where you lost control so you can target drills for the next session.\n\nClosing encouragement\n\nThe omaplata rewards patience and attention to small details. It is a technique that grows richer as you understand the joint mechanics, feel the angles, and learn to read opponents' reactions. Train methodically, keep a practice log of what works and what does not, and use the omaplata to expand your offensive options rather than relying on it as a single go-to finish. Over time you will build the timing and comfort to use it in both training and competition.\n",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T07:32:48.000Z",
    "publishedAt": "2025-10-13T07:32:48.000Z",
    "updatedAt": "2025-10-13T07:32:48.000Z"
  },
  {
    "id": "Jj0GHazX2hPDgLVWVANq",
    "title": "Brazilian Jiu-Jitsu: TEST",
    "sport": "bjj",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute TEST techniques with proper form and timing",
      "Apply TEST principles in competitive scenarios",
      "Understand the biomechanical foundations of TEST",
      "Integrate TEST into overall bjj strategy"
    ],
    "sections": [
      {
        "id": "section-1760391095907-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for TEST.\n\n**Movement Preparation:**\n- Guard pulling and hip mobility drills\n- Bridging and shrimping movements\n- Grip strength activation\n- Core stability exercises\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760391095907-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper positioning relative to opponent\n- Check grip placement and pressure points\n- Verify foot positioning and weight distribution\n- Ensure optimal body alignment for force generation\n\n**Execution Phase:**\n1. Initial Movement: Begin with deliberate positioning, ensuring you have established the proper grip and stance for TEST execution.\n2. Transition Point: Identify the optimal moment when your opponent's balance or position allows for TEST application.\n3. Force Application: Apply controlled, progressive force using proper body mechanics and leverage principles specific to TEST.\n4. Follow-Through: Complete the movement with proper control and transition to advantageous position or next technique sequence.\n\n**Common Mistakes & Corrections:**\n❌ Rushing the setup phase → ✅ Take 2-3 seconds to establish proper positioning\n❌ Using excessive force early → ✅ Build pressure gradually through proper leverage\n❌ Neglecting opposite-side awareness → ✅ Maintain peripheral vision",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760391095907-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Partners alternate executing TEST technique\n- Focus on form over speed\n- Coach provides individual corrections\n\n**Drill 2: Resistance Training (3 minutes)**\n- Add progressive resistance to TEST execution\n- Build strength and muscle memory\n- Emphasize proper breathing under pressure\n\n**Drill 3: Live Application (2 minutes)**\n- Integrate TEST into free-form practice\n- Encourage experimentation with timing and setup\n- Monitor for safety and proper execution\n\n**Competition Simulation:**\nPractice TEST under competition-like conditions with time pressure scenarios and strategic decision making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760391095907-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for TEST\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice TEST technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      }
    ],
    "tags": [
      "bjj",
      "test",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "YwqLeg1qMcS3bUhf61FIBsBUAGx1",
    "creatorName": "Lona Vincent",
    "creatorEmail": "lv255@cornell.edu",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T21:33:26.000Z",
    "publishedAt": "2025-10-13T21:33:26.000Z",
    "updatedAt": "2025-10-13T21:33:26.000Z"
  },
  {
    "id": "Jjc1wLP14vhfpaiVuJp8",
    "title": "Trips 50 hitch",
    "sport": "football",
    "level": "advanced",
    "duration": 6,
    "objectives": [
      "Right side X has a 5yd curl/hitch"
    ],
    "sections": [],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "tgAXwLxXFWSm80yG5i5Mw3FRwts1",
    "creatorName": "Eleazar",
    "creatorEmail": "eleazarzaragozallanes@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-15T04:18:14.000Z",
    "publishedAt": "2025-10-15T04:18:14.000Z",
    "updatedAt": "2025-10-15T04:18:14.000Z"
  },
  {
    "id": "QniB1GS3EadqWOJoRtFt",
    "title": "Leg Drag Guard Pass (control, pin, and pass to dominant top)",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760131958491",
        "title": "Leg Drag Guard Pass",
        "type": "text",
        "content": "Goal: Use the leg drag to take lateral control of the opponent’s hips, pin their near leg, and walk to side control or mount with minimal risk.\n\nWhy we train it\n\nLeg drag provides a quick path around stubborn guards, especially open guards and spider guard. It compresses their base and opens the back or side control transitions.\n\nStep-by-step mechanics\n\nGrip and posture\n\nFrom standing or kneeling in guard, secure a cuff or pant leg grip on the far ankle with your outside arm and inside lapel or belt grip with the other if in Gi. In no-gi, control the ankle and the knee/hip line.\n\nPosture with hips low and weight centered.\n\nDrag the leg across the body\n\nStep to the outside of their trapped leg with your near-side knee, and drag their foot across their body toward the opposite hip.\n\nUse your chest or shoulder to pin the knee to the mat while stepping around.\n\nPin the knee and control the hips\n\nAnchor the dragged foot with your outside hip and shin across their thigh to block recovery.\n\nApply lateral pressure to their hips so they cannot shrimp.\n\nAdvance your hips and pass\n\nWalk your outside leg around and sink your weight down, establishing chest-to-hip contact.\n\nSecure underhook on the far arm or cross-face, then flatten and move into side control or knee slide to mount.\n\nVariations and transitions\n\nKnee cut after leg drag: If opponent turns in, knee slice through to side control.\n\nBack take: If they turtle to recover, use your posted hand and step around their back to seatbelt and take hooks.\n\nPressure pass: After pinning the leg, use heavy shoulder pressure and leg weave to pass to mount.\n\nDrills and repetitions\n\nPartner flow: Start in open guard; attacker presents different frames. Perform leg drag and pass 5 times each side slowly.\n\nPositional sparring: Attacker tries to recover guard; passer attempts leg drag pass only for 3-minute rounds.\n\nIsolated drill: From knees, leg drag and hold the pin for 10 seconds, reset, repeat 6 times.\n\nCommon errors and corrections\n\nNot pinning the knee: They can shrimp out. Correction: anchor with your hip and keep chest on their thigh.\n\nLeaning too long on arms: Lose control. Correction: get your hips around quickly and use underhook or cross-face.\n\nWrong angle: If you don’t step off the line, they can re-guard. Correction: step wide and create angle.\n\nCoaching cues\n\n“Drag it across and lock their knee to the mat.”\n\n“Hips around, chest heavy, underhook that arm.”\n\n“Walk around, don’t reach—use your legs to move.”",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T21:33:11.000Z",
    "publishedAt": "2025-10-10T21:33:11.000Z",
    "updatedAt": "2025-10-10T21:33:11.000Z"
  },
  {
    "id": "RmuNkcdvvQUg6b1nBs1k",
    "title": "Brazilian Jiu-Jitsu: Heel Hooks",
    "sport": "bjj",
    "level": "advanced",
    "duration": 45,
    "objectives": [
      "Execute Heel Hooks techniques with proper form and timing",
      "Apply Heel Hooks principles in competitive scenarios",
      "Understand the biomechanical foundations of Heel Hooks",
      "Integrate Heel Hooks into overall bjj strategy"
    ],
    "sections": [],
    "tags": [
      "bjj",
      "heel hooks",
      "advanced",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "content": "# Brazilian Jiu-Jitsu: Heel Hooks\n\n**Duration:** 45 minutes\n**Level:** Advanced\n**Focus:** Mastering Heel Hooks\n\n**Special Instructions:** A heel hook is a leg lock that attacks the ankle, foot, and especially the knee by twisting the heel. It creates rotational force through the lower leg that the ligaments around the knee are not built to tolerate. Because damage can happen very quickly and without much pain beforehand, heel hooks are treated as high risk and are restricted in many gi competitions and for lower belt levels.\n\n---\n\n## Learning Objectives\n\nBy the end of this session, you will be able to:\n- Execute Heel Hooks techniques with proper form and timing\n- Apply Heel Hooks principles in competitive game situations\n- Understand the biomechanical foundations of Heel Hooks\n- Integrate Heel Hooks seamlessly into your bjj strategy\n- Recognize and capitalize on opportunities to use Heel Hooks effectively\n\n---\n\n## Part 1: Warm-Up & Technical Foundation (10 minutes)\n\n### Movement Preparation\n\nStart with sport-specific movement patterns that activate the muscle groups essential for Heel Hooks. This isn't just about getting warm - it's about priming your neuromuscular system for the specific demands of Heel Hooks.\n\n**Dynamic Warm-Up Sequence:**\n\n- Guard pulling and hip mobility drills (2 min)\n- Bridging and shrimping movements (2 min)\n- Grip strength activation - dead hangs and gi grips (2 min)\n- Core stability exercises - planks and side planks (2 min)\n- Sport-specific movement patterns for Heel Hooks (2 min)\n\n### Technical Foundation Review\n\nBefore diving into advanced Heel Hooks execution, let's ensure your fundamentals are rock solid. the foundation is everything.\n\n**Core Principles:**\n1. **Body Positioning:** Proper stance, weight distribution, and alignment create the platform for success\n2. **Breathing Pattern:** Coordinated breathing with movement execution - exhale on exertion\n3. **Mental Focus:** Concentration points and awareness cues - where should your attention be?\n4. **Safety Protocols:** Injury prevention and proper progression - train smart, not just hard\n\n---\n\n## Part 2: Deep Dive - Mastering Heel Hooks (25 minutes)\n\n### The Setup Phase (Critical Foundation)\n\n**Position Before Submission:**\n- Establish proper positioning relative to opponent - position before submission\n- Check grip placement and pressure points - grips dictate attacks\n- Verify foot positioning and weight distribution - base equals power\n- Ensure optimal body alignment for force generation - use angles, not muscles\n- Read opponent's reactions and defensive posture - where are they vulnerable?\n- Mental chess: If they defend this, what's my next attack?\n\nJiu-jitsu is physical chess. Think two moves ahead.\n\nThis setup phase is non-negotiable. Rush it, and everything that follows will be compromised. Take your time here.\n\n### Initial Movement & Positioning\n\n**Positioning & Grip Fundamentals:**\nBegin by establishing positional dominance - your base should be rock solid with your feet positioned for maximum stability (typically one forward, one back in a staggered stance). For Heel Hooks, grip placement is everything: secure your primary grips with a firm but not exhausted grip (60-70% strength), positioning your hands on traditional control points (collar, sleeve, pants, belt). Your posture should create the proper angles - if on top, your hips should be heavy and forward; if on bottom, your frames should create space while your legs control distance. Before initiating Heel Hooks, scan for your opponent's weight distribution: Are they more weighted on their right or left? Where are their defensive grips? What's their base like? Process their positioning and identify the opening. Mental preparation: visualize the complete chain - if this works, where do I transition next? If they defend, what's my backup plan? This tactical thinking must be instant.\n\n### Reading the Situation & Timing Your Execution\n\nThe transition to Heel Hooks requires reading the situation and timing your execution perfectly.\n\n### Force Application & Execution\n\nApply controlled, progressive force using leverage, not strength. Small adjustments in angle multiply your effective force dramatically. Pressure should build like a vice, not explode like a bomb.\n\nYour body should move as one coordinated unit. Power comes from the ground up - legs drive hips, hips drive core, core transfers energy to your point of contact.\n\n### Follow-Through & Finish\n\nComplete with control and immediate position assessment. Did it work? Secure position. Didn't work? Transition immediately. Never stay static.\n\nNever stop halfway. Complete every rep with full commitment to the movement pattern.\n\n### Common Mistakes & Corrections\n\nI've seen these mistakes hundreds of times. Let's make sure you avoid them:\n\n**Mistake #1:** Rushing the setup\n**Fix:** Position before submission - take your time\n\n**Mistake #2:** Using muscle instead of leverage\n**Fix:** If you're using all your strength, your angle is wrong\n\n**Mistake #3:** Forgetting defense while attacking\n**Fix:** Attack and defend simultaneously - always\n\nThe difference between good and great athletes is attention to these details. Good athletes know what to do. Great athletes know what NOT to do.\n\n\n\n### Advanced Variations for Advanced Athletes\n\n**Speed & Timing Variation:** Execute Heel Hooks with increased tempo and sharper timing. This variation focuses on quick recognition and instant execution. Use this when opponents are slower to react or when you have a speed advantage. Key: maintain technique even as speed increases.\n\n**Power & Precision Variation:** Execute Heel Hooks with emphasis on maximum force and pinpoint accuracy. This variation sacrifices some speed for devastating effectiveness. Use this when you have position advantage or when one perfect rep is better than multiple good ones. Key: quality of execution over quantity of attempts.\n\n### Tactical Applications in Competition\n\nUnderstanding the technique is one thing. Knowing WHEN to use it is what separates athletes who win from athletes who just train.\n\n**Offensive Opportunities:**\nUse Heel Hooks when you recognize opponent vulnerability or situational opportunity. Look for: defensive overcommitment, positional advantages, timing windows, or pattern breaks. The best offense is opportunistic - recognize and capitalize instantly.\n\n**Defensive Considerations:**\nWhile executing Heel Hooks, maintain awareness of counter-attacks and defensive responsibilities. Every offensive action creates defensive vulnerability. Know what you're exposing and be ready to defend it. Attack smart, not reckless.\n\n**Transition Opportunities:**\nHeel Hooks should flow seamlessly into your next action. Chain techniques together - if this works, what's next? If they defend, what's my counter? Think three moves ahead. The technique is just one link in the chain.\n\n---\n\n## Part 3: Practice & Application (8 minutes)\n\n### Progressive Drilling Sequence\n\n**Drill 1: Technical Repetition (3 min)**\nPartners alternate executing Heel Hooks - 10 reps each side. Focus on perfect form. Coach corrects immediately. Quality over quantity.\n\n**Drill 2: Progressive Resistance (3 min)**\nSame technique, add 25% resistance, then 50%, then 75%. Build your ability to execute under pressure. Form shouldn't change as resistance increases.\n\n**Drill 3: Live Application (2 min)**\nFree roll but hunt specifically for Heel Hooks opportunities. Set it up, see the opening, take it. Real-time recognition and execution.\n\n### Live Competition Simulation\n\nNow we take everything we've learned and apply it under pressure. This is where champions are made.\n\n- Practice Heel Hooks with time constraints and fatigue\n- Execute against multiple opponent styles/situations\n- Make real-time decisions about when to use Heel Hooks\n- Manage your energy and maintain technique quality under stress\n\nThe drill is the teacher. The game is the test. Train like you compete, compete like you train.\n\n---\n\n## Cool-Down & Integration (2 minutes)\n\n### Key Takeaways - What to Remember\n\nYour brain can only hold so much. Here are the three things I want you to remember from today:\n\n1. **Primary Execution Cue:** Setup first, then execute - never rush the foundation of Heel Hooks\n2. **Most Common Mistake:** Rushing the technique instead of trusting the process\n3. **Best Opportunity Signal:** When you see the opening clearly and your body position is optimal - that's your moment\n\n### Cool-Down Protocol\n\n- Light stretching focusing on muscle groups used in Heel Hooks\n- Breathing exercises for recovery (4-7-8 breathing pattern)\n- Mental reflection: What felt good? What needs work?\n- Hydration and nutrition within 30 minutes\n\n### Practice Homework\n\nHere's what I want you to work on before we meet again:\n\n**Daily Practice (10 minutes):**\n- 10 perfect repetitions of Heel Hooks setup phase - focus on quality, not speed\n- Visualize Heel Hooks execution in 3 different game scenarios\n- Watch video examples if available and identify the key moments\n\n**Mental Preparation:**\n- Before bed, mentally rehearse Heel Hooks execution 5 times\n- See yourself succeeding, feel the movement, hear the sounds\n- This mental practice is as important as physical reps\n\n**Journal Prompt:**\nWrite down: \"The one thing that clicked for me today about Heel Hooks was...\"\n\n\n\n---\n\n## Coach Notes & Adaptations\n\n**Safety Reminders:**\n- Monitor athletes for signs of fatigue - technique breaks down when tired\n- Ensure proper hydration throughout session\n- Watch for overexertion during live practice - ego can override good judgment\n\n**Individual Adaptations:**\n- Modify Heel Hooks technique for different body types and athletic backgrounds\n- Adjust intensity based on experience level - push, don't break\n- Provide additional support for struggling athletes - everyone learns at their own pace\n\n**Assessment Criteria:**\n- Technical execution accuracy (form first, speed second)\n- Understanding of application principles (when to use it)\n- Ability to adapt under pressure (can they adjust mid-execution?)\n- Safety awareness and control (always)\n\n---\n\n**Final Word:**\n\nHeel Hooks is not just a technique - it's a weapon you add to your arsenal. Master it through deliberate practice, understand it through competition, and refine it through constant feedback.\n\nRemember: Perfect practice makes perfect. See you at the next session.\n\n---\n\n*This lesson plan provides a comprehensive framework for mastering Heel Hooks in bjj. Adjust timing and intensity based on individual needs and facility constraints. The goal is not just to teach the technique, but to develop athletes who think, adapt, and excel under pressure.*\n",
    "videoUrl": "https://www.youtube.com/shorts/azf8cUICxus",
    "createdAt": "2025-10-20T17:33:37.000Z",
    "publishedAt": "2025-10-20T17:33:37.000Z",
    "updatedAt": "2025-10-20T17:33:37.000Z"
  },
  {
    "id": "S27lX9PaPMnurn92ZMYm",
    "title": "Cross Collar Choke",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760084334623",
        "title": "Cross Collar Choke ",
        "type": "text",
        "content": "Goal: Secure two deep collar grips and use torque and body mechanics to create a high-percentage choke from closed guard.\n\nWhy we train it\n\nThe cross collar choke is a core submission in gi Jiu Jitsu. It teaches grip fighting, posture breaking, and subtle body mechanics rather than brute strength.\n\nStep-by-step mechanics\n\nInitial grips and posture break\n\nFrom closed guard, control one sleeve or the back of the wrist with one hand to prevent posture.\n\nBreak posture with hip drive, pulling them forward with feet on hips or one foot on the hip and the other hooking the hip.\n\nEstablish the first collar grip\n\nWith your dominant hand, reach deep into the opponent’s collar on the far side. Your thumb should be tucked in and the blade of your hand inside the collar, palm toward you.\n\nPull the collar across their neck to flatten them.\n\nSet the second grip (crossing hand)\n\nWith your other hand, reach under and grab the opposite collar, again deep, so the fingers can pull the collar across. The grips should form an X across the neck when both are pulled.\n\nYour elbows should be low and close to your ribs so the chokepath is horizontal across the carotid arteries.\n\nFinish mechanics\n\nSqueeze and rotate your torso while pulling both hands in opposite directions. Use your shoulders and back, not biceps.\n\nFor added leverage, expand your guard slightly and use your shin to push on their ribs or hip to prevent their bridge escape.\n\nOptionally, sit up slightly and use your legs to rotate their head for a quicker finish.\n\nVariations and set-ups\n\nCross collar to armbar: If they posture and defend the choke, switch to an armbar by isolating the wrist and swinging the leg over.\n\nCross collar with hip bump sweep: Break posture, set collar, bump to side sweep as they react, and tighten choke once on top.\n\nDrills and repetitions\n\nGrip entry drill: 5 slow reps where you focus only on deep collar grips, no finish.\n\nTiming drill: Partner resists posture; you break and immediately set cross-collar, 6 reps each side.\n\nLive guard rounds: Start with closed guard and attempt cross collar or transitions for 3-minute rounds.\n\nCommon mistakes and corrections\n\nShallow grips: Collar must be deep. Correction: slide your hand as far up the collar as possible with thumb in.\n\nUsing arms only: The finish should use torso rotation. Correction: rotate chest and pull with shoulder blades.\n\nLeaving elbows high: This creates space. Correction: keep elbows tight and hug the opponent’s upper chest.\n\nCoaching cues\n\n“Two deep grips, elbows in, rotate your chest.”\n\n“Pull collar to collar, don’t yank with your biceps.”\n\n“Use your hips to break posture before you take the grips.”\n\nSafety and training hygiene\n\nTap early; when partner taps, release immediately.\n\nDrill the finish slowly at first. Build speed only after the grip pathways are automatic.\n\nWarm up ankles, knees, and neck before drilling takedowns and chokes.\n\nFor chokes, practice from the bottom and top so both partners understand the feeling and when to tap.\n\nSuggested week plan (how to train these)\n\nDay 1: Warm-up, 20 minutes drilling single leg entries and finishes, 20 minutes positional sparring (standing entries) and 10 minutes cool down.\n\nDay 2: Warm-up, 25 minutes leg drag sequences and passing, 20 minutes situational rolling starting in guard, finish with 10 minutes technique review.\n\nDay 3: Warm-up, 30 minutes cross collar grip drills and finishing, 20 minutes live guard rounds with focus on submissions, short mobility cool down.",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "public",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T08:19:16.000Z",
    "publishedAt": "2025-10-10T08:19:16.000Z",
    "updatedAt": "2025-10-10T08:19:16.000Z"
  },
  {
    "id": "SnJ7EJMVJ4MjTZG4cOx8",
    "title": "The berimbolo",
    "sport": "bjj",
    "level": "intermediate",
    "duration": 60,
    "objectives": [
      "Explain the underlying mechanics of the berimbolo and its purpose in modern guard play.",
      "Demonstrate correct grips and leg positioning from the De La Riva guard",
      "Perform the full berimbolo movement from De La Riva to back control in a controlled sequence.",
      "Recognize key control points (hip control, knee line, and leg entanglement) that make the berimbolo effective."
    ],
    "sections": [],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "content": "1. Introduction and Concept Overview\n\nThe berimbolo is a dynamic sweep and back-take transition that originated from the evolution of the De La Riva guard. Its goal is to invert underneath your opponent, destabilize their base, and rotate into back control or top position.\nThe move became famous in the early 2010s through Rafael and Guilherme Mendes, who refined it into a complete system that dominates the modern jiu-jitsu meta.\n\nConceptually, the berimbolo represents lever-based rotation — using your opponent’s leg as an axis to turn their hips and expose their back. Rather than forcing strength or explosion, it relies on connection, timing, and precise control.\n\n2. Technical Breakdown\nStarting Position – De La Riva Guard Setup\n\nBottom player sits to the side of the opponent’s lead leg.\n\nOutside leg: hooks behind the opponent’s thigh (De La Riva hook).\n\nInside leg: presses on their far hip or thigh for distance control.\n\nNear hand: grips the opponent’s heel or pant cuff.\n\nFar hand: controls the belt, far hip, or collar (depending on gi or no-gi).\n\nGoal: Maintain constant tension in the De La Riva hook and keep your hip close to their foot.\n\nStep 1: Off-Balancing and Entry\n\nPull the opponent’s heel toward you to shift their weight forward.\n\nSimultaneously, scoot your hips slightly under their leg to create inversion space.\n\nYour De La Riva hook tightens as you drop your shoulder to the mat, keeping the leg trapped.\n\nYour far hand maintains hip control; this is your anchor point for the spin.\n\nKey cue: “Pull, rotate, and stay glued.” You should feel like you’re rolling under their leg without losing chest-to-thigh contact.\n\nStep 2: Inversion and Leg Entanglement\n\nContinue rotating under the opponent, switching your hips so your knees face upward.\n\nYour outside leg now comes across to trap their far thigh (often called the “leg drag” side).\n\nKeep your bottom leg pinched around their near leg; this maintains the leg entanglement.\n\nMaintain your grip on the far hip — never release it mid-roll.\n\nCommon error: Trying to spin too fast or without connection. The move should feel like a tight spiral, not a cartwheel.\n\nStep 3: Hip Rotation and Back Exposure\n\nAs you complete your inversion, pull their hip down toward your chest.\n\nKick your top leg over their far leg to start climbing their back line.\n\nUse your bottom leg to “punch” the mat and spin yourself into alignment behind them.\n\nMaintain chest-to-hip contact at all times.\n\nKey visual: You are rotating around their leg the way a key rotates inside a lock — tight, controlled, never loose.\n\nStep 4: Transition to Back Control or Top Position\n\nFor back take: Pull the opponent backward while inserting your hooks. Use your far hand to establish seatbelt control.\n\nFor sweep: If they post or turn, come up on your elbow and knee to establish leg-drag top control.\n\nIn both cases, keep the opponent’s hips controlled until you’ve stabilized.\n\n3. Safety Considerations\n\nAlways warm up the neck, shoulders, and lower back before drilling.\n\nAvoid slamming the shoulders or neck onto the mat during inversion.\n\nWhen teaching beginners, focus on partial inversions before full berimbolo entries.\n\nRemind partners to release grips if tension builds unnaturally around the knee or ankle.\n\n4. Progressive Drills\nDrill 1: Inversion Flow (Solo)\n\nLie on your side and practice rolling onto your shoulders, alternating directions.\n\nFocus on staying compact and returning to a seated position after each roll.\n\nDrill 2: Hook and Hip Drill (Partner)\n\nFrom seated open guard, establish De La Riva hook and belt grip.\n\nPractice pulling your partner’s heel and inverting halfway, stopping at hip rotation.\n\nRepeat in slow motion to build balance awareness.\n\nDrill 3: Full Berimbolo to Sweep\n\nPartner maintains posture while you perform the full berimbolo sequence.\n\nStop once you reach top leg-drag position, then reset.\n\nEmphasize control, not speed.\n\nDrill 4: Berimbolo to Back Take\n\nAdd the final step: after inversion, climb the hip line and secure the back.\n\nWork with light resistance to test transitions between positions.\n\n5. Common Mistakes & Corrections\nMistake\tCorrection\nLosing grip on far hip\tKeep the belt/hip grip until your chest is aligned with their hip\nInverting too far from opponent\tKeep your shoulder tight to their shin before rolling\nFlat inversion (rolling straight back)\tAngle off to the side; think of a corkscrew, not a somersault\nUsing strength instead of leverage\tFocus on pulling with grips and pushing with legs simultaneously\nGetting smashed mid-roll\tCreate space before inverting; don’t go under heavy pressure\n6. Coaching Points\n\nEncourage students to slow down the movement. The berimbolo is about control, not speed.\n\nStress connection over flexibility — tight grips and leg pressure matter more than extreme inversion.\n\nWhen demonstrating, break the move into three clear pauses: entry → inversion → finish.\n\nEmphasize that the berimbolo is just one option from De La Riva; teach it as part of a larger positional system.\n\n7. Lesson Review and Key Takeaways\n\nThe berimbolo transitions from De La Riva guard to the back by inverting under and rotating around the opponent’s leg.\n\nCore principles: connection, rotation, hip control, and leg entanglement.\n\nIt’s a leverage-based movement — the smaller player can use it to off-balance a heavier opponent.\n\nWhen practiced safely and with positional awareness, it becomes one of the most effective back-taking tools in sport BJJ.\n\n8. Optional Extensions (Advanced Variations)\n\nBerimbolo to leg drag pass\n\nReverse berimbolo from 50/50\n\nNo-gi adaptation using underhook and ankle control instead of pants grips\n\nTransition from crab ride to back take",
    "videoUrl": "https://firebasestorage.googleapis.com/v0/b/gameplan-787a2.firebasestorage.app/o/lesson-videos%2FOQuvoho6w3NC9QTBLFSoIK7A2RQ2%2F1760981885373_test_.mp4?alt=media&token=d2b7b22a-d42e-497b-8b90-7b3a648231c3",
    "createdAt": "2025-10-20T17:39:14.000Z",
    "publishedAt": "2025-10-20T17:39:14.000Z",
    "updatedAt": "2025-10-20T17:39:14.000Z"
  },
  {
    "id": "UWPmzwjpgK8UE7PjcKOY",
    "title": "Football: Proper tackling technique",
    "sport": "football",
    "level": "intermediate",
    "duration": 45,
    "objectives": [
      "Execute Proper tackling technique techniques with proper form and timing",
      "Apply Proper tackling technique principles in competitive scenarios",
      "Understand the biomechanical foundations of Proper tackling technique",
      "Integrate Proper tackling technique into overall football strategy"
    ],
    "sections": [
      {
        "id": "section-1760346390391-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for Proper tackling technique.\n\n**Movement Preparation:**\n- Position-specific movement patterns\n- Acceleration and deceleration drills\n- Contact preparation exercises\n- Agility ladder work\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760346390391-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper alignment and spacing based on formation\n- Check body position and balance for Proper tackling technique\n- Verify field awareness and read defensive alignment\n- Ensure proper hand placement (if applicable) and footwork\n\n**Execution Phase:**\n1. Initial Movement: Begin with proper stance and footwork, ensuring your body position and field awareness are optimal for Proper tackling technique execution.\n2. Transition Point: Identify the optimal moment based on defensive alignment or play development that allows for Proper tackling technique execution.\n3. Force Application: Execute the movement with proper speed, power, and body control using correct football mechanics for Proper tackling technique.\n4. Follow-Through: Complete the play with proper finish, maintaining balance and transitioning to the next play or defensive position.\n\n**Common Mistakes & Corrections:**\n❌ Poor initial stance → ✅ Establish proper three-point or two-point stance\n❌ Rushing the snap timing → ✅ Time your movement with the snap count\n❌ Losing field awareness → ✅ Keep your head on a swivel and read the play",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760346390391-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Execute Proper tackling technique technique in controlled reps\n- Focus on footwork and body positioning\n- Coach provides individual feedback on form\n\n**Drill 2: Resistance & Conditioning (3 minutes)**\n- Practice Proper tackling technique with resistance bands or against resistance\n- Build strength specific to the movement\n- Maintain proper form under increased load\n\n**Drill 3: Live Game Simulation (2 minutes)**\n- Execute Proper tackling technique in game-like scenarios\n- Add defensive pressure and game speed\n- Monitor for proper technique under competition conditions\n\n**Competition Simulation:**\nPractice Proper tackling technique in full-speed game situations with proper spacing, timing, and decision-making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760346390391-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for Proper tackling technique\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice Proper tackling technique technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      }
    ],
    "tags": [
      "football",
      "proper tackling technique",
      "intermediate",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T09:07:12.000Z",
    "publishedAt": "2025-10-13T09:07:12.000Z",
    "updatedAt": "2025-10-13T09:07:12.000Z"
  },
  {
    "id": "YK0CdslPEy1kPRTA6YmC",
    "title": "Soccer: passing fundamentals",
    "sport": "soccer",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute passing fundamentals techniques with proper form and timing",
      "Apply passing fundamentals principles in competitive scenarios",
      "Understand the biomechanical foundations of passing fundamentals",
      "Integrate passing fundamentals into overall soccer strategy"
    ],
    "sections": [
      {
        "id": "section-1760346491517-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for passing fundamentals.\n\n**Movement Preparation:**\n- Dynamic leg swings and stretches\n- Footwork and ball control drills\n- Acceleration and change of direction\n- Passing accuracy warm-up\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760346491517-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Position yourself relative to the ball and field\n- Check your body orientation and balance\n- Verify foot positioning and weight distribution\n- Ensure proper field vision and teammate awareness\n\n**Execution Phase:**\n1. Initial Movement: Start with proper ball positioning and body orientation, ensuring your balance and field vision support passing fundamentals technique.\n2. Transition Point: Read the field situation and defender positioning to find the right moment for passing fundamentals application.\n3. Force Application: Apply the technique with proper timing, ball contact, and body positioning specific to passing fundamentals.\n4. Follow-Through: Finish the movement with proper body control and immediate transition to next phase of play.\n\n**Common Mistakes & Corrections:**\n❌ Poor ball positioning → ✅ Ensure ball is in optimal position before execution\n❌ Rushing the touch → ✅ Time your movement to maintain control\n❌ Losing field awareness → ✅ Check your surroundings before and during execution",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760346491517-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Ball Control & Repetition (3 minutes)**\n- Practice passing fundamentals with stationary ball, then moving ball\n- Focus on proper foot placement and ball contact\n- Coach provides feedback on technique and form\n\n**Drill 2: Pressure Training (3 minutes)**\n- Add passive defender to increase difficulty\n- Practice passing fundamentals with time constraints\n- Maintain proper form with defensive pressure\n\n**Drill 3: Small-Sided Game (2 minutes)**\n- Apply passing fundamentals in 3v3 or 4v4 game situation\n- Encourage recognition of when to use technique\n- Monitor execution quality in game flow\n\n**Competition Simulation:**\nPractice passing fundamentals in full 11v11 or reduced game scenarios with proper spacing and game decision-making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760346491517-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for passing fundamentals\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice passing fundamentals technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      }
    ],
    "tags": [
      "soccer",
      "passing fundamentals",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T09:08:28.000Z",
    "publishedAt": "2025-10-13T09:08:28.000Z",
    "updatedAt": "2025-10-13T09:08:28.000Z"
  },
  {
    "id": "fioSrq1ms0b5kqtWR5Ue",
    "title": "Brazilian Jiu-Jitsu: passing",
    "sport": "bjj",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute passing techniques with proper form and timing",
      "Apply passing principles in competitive scenarios",
      "Understand the biomechanical foundations of passing",
      "Integrate passing into overall bjj strategy"
    ],
    "sections": [],
    "tags": [
      "bjj",
      "passing",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "content": "# Brazilian Jiu-Jitsu: passing\n\n**Duration:** 45 minutes\n**Level:** Beginner\n**Focus:** Mastering passing\n\n**Special Instructions:** basics of passing\n\n---\n\n## Learning Objectives\n\nBy the end of this session, you will be able to:\n- Execute passing techniques with proper form and timing\n- Apply passing principles in competitive game situations\n- Understand the biomechanical foundations of passing\n- Integrate passing seamlessly into your bjj strategy\n- Recognize and capitalize on opportunities to use passing effectively\n\n---\n\n## Part 1: Warm-Up & Technical Foundation (10 minutes)\n\n### Movement Preparation\n\nStart with sport-specific movement patterns that activate the muscle groups essential for passing. This isn't just about getting warm - it's about priming your neuromuscular system for the specific demands of passing.\n\n**Dynamic Warm-Up Sequence:**\n\n- Guard pulling and hip mobility drills (2 min)\n- Bridging and shrimping movements (2 min)\n- Grip strength activation - dead hangs and gi grips (2 min)\n- Core stability exercises - planks and side planks (2 min)\n- Sport-specific movement patterns for passing (2 min)\n\n### Technical Foundation Review\n\nBefore diving into advanced passing execution, let's ensure your fundamentals are rock solid. the foundation is everything.\n\n**Core Principles:**\n1. **Body Positioning:** Proper stance, weight distribution, and alignment create the platform for success\n2. **Breathing Pattern:** Coordinated breathing with movement execution - exhale on exertion\n3. **Mental Focus:** Concentration points and awareness cues - where should your attention be?\n4. **Safety Protocols:** Injury prevention and proper progression - train smart, not just hard\n\n---\n\n## Part 2: Deep Dive - Mastering passing (25 minutes)\n\n### The Setup Phase (Critical Foundation)\n\n**Position Before Submission:**\n- Establish proper positioning relative to opponent - position before submission\n- Check grip placement and pressure points - grips dictate attacks\n- Verify foot positioning and weight distribution - base equals power\n- Ensure optimal body alignment for force generation - use angles, not muscles\n- Read opponent's reactions and defensive posture - where are they vulnerable?\n- Mental chess: If they defend this, what's my next attack?\n\nJiu-jitsu is physical chess. Think two moves ahead.\n\nThis setup phase is non-negotiable. Rush it, and everything that follows will be compromised. Take your time here.\n\n### Initial Movement & Positioning\n\n**Positioning & Grip Fundamentals:**\nBegin by establishing positional dominance - your base should be rock solid with your feet positioned for maximum stability (typically one forward, one back in a staggered stance). For passing, grip placement is everything: secure your primary grips with a firm but not exhausted grip (60-70% strength), positioning your hands on traditional control points (collar, sleeve, pants, belt). Your posture should create the proper angles - if on top, your hips should be heavy and forward; if on bottom, your frames should create space while your legs control distance. Before initiating passing, scan for your opponent's weight distribution: Are they more weighted on their right or left? Where are their defensive grips? What's their base like? Process their positioning and identify the opening. Mental preparation: visualize the complete chain - if this works, where do I transition next? If they defend, what's my backup plan? This tactical thinking must be instant.\n\n### Reading the Situation & Timing Your Execution\n\nThe transition to passing requires reading the situation and timing your execution perfectly.\n\n### Force Application & Execution\n\nApply controlled, progressive force using leverage, not strength. Small adjustments in angle multiply your effective force dramatically. Pressure should build like a vice, not explode like a bomb.\n\nYour body should move as one coordinated unit. Power comes from the ground up - legs drive hips, hips drive core, core transfers energy to your point of contact.\n\n### Follow-Through & Finish\n\nComplete with control and immediate position assessment. Did it work? Secure position. Didn't work? Transition immediately. Never stay static.\n\nNever stop halfway. Complete every rep with full commitment to the movement pattern.\n\n### Common Mistakes & Corrections\n\nI've seen these mistakes hundreds of times. Let's make sure you avoid them:\n\n**Mistake #1:** Rushing the setup\n**Fix:** Position before submission - take your time\n\n**Mistake #2:** Using muscle instead of leverage\n**Fix:** If you're using all your strength, your angle is wrong\n\n**Mistake #3:** Forgetting defense while attacking\n**Fix:** Attack and defend simultaneously - always\n\nThe difference between good and great athletes is attention to these details. Good athletes know what to do. Great athletes know what NOT to do.\n\n\n\n### Advanced Variations for Beginner Athletes\n\n**Speed & Timing Variation:** Execute passing with increased tempo and sharper timing. This variation focuses on quick recognition and instant execution. Use this when opponents are slower to react or when you have a speed advantage. Key: maintain technique even as speed increases.\n\n**Power & Precision Variation:** Execute passing with emphasis on maximum force and pinpoint accuracy. This variation sacrifices some speed for devastating effectiveness. Use this when you have position advantage or when one perfect rep is better than multiple good ones. Key: quality of execution over quantity of attempts.\n\n### Tactical Applications in Competition\n\nUnderstanding the technique is one thing. Knowing WHEN to use it is what separates athletes who win from athletes who just train.\n\n**Offensive Opportunities:**\nUse passing when you recognize opponent vulnerability or situational opportunity. Look for: defensive overcommitment, positional advantages, timing windows, or pattern breaks. The best offense is opportunistic - recognize and capitalize instantly.\n\n**Defensive Considerations:**\nWhile executing passing, maintain awareness of counter-attacks and defensive responsibilities. Every offensive action creates defensive vulnerability. Know what you're exposing and be ready to defend it. Attack smart, not reckless.\n\n**Transition Opportunities:**\npassing should flow seamlessly into your next action. Chain techniques together - if this works, what's next? If they defend, what's my counter? Think three moves ahead. The technique is just one link in the chain.\n\n---\n\n## Part 3: Practice & Application (8 minutes)\n\n### Progressive Drilling Sequence\n\n**Drill 1: Technical Repetition (3 min)**\nPartners alternate executing passing - 10 reps each side. Focus on perfect form. Coach corrects immediately. Quality over quantity.\n\n**Drill 2: Progressive Resistance (3 min)**\nSame technique, add 25% resistance, then 50%, then 75%. Build your ability to execute under pressure. Form shouldn't change as resistance increases.\n\n**Drill 3: Live Application (2 min)**\nFree roll but hunt specifically for passing opportunities. Set it up, see the opening, take it. Real-time recognition and execution.\n\n### Live Competition Simulation\n\nNow we take everything we've learned and apply it under pressure. This is where champions are made.\n\n- Practice passing with time constraints and fatigue\n- Execute against multiple opponent styles/situations\n- Make real-time decisions about when to use passing\n- Manage your energy and maintain technique quality under stress\n\nThe drill is the teacher. The game is the test. Train like you compete, compete like you train.\n\n---\n\n## Cool-Down & Integration (2 minutes)\n\n### Key Takeaways - What to Remember\n\nYour brain can only hold so much. Here are the three things I want you to remember from today:\n\n1. **Primary Execution Cue:** Setup first, then execute - never rush the foundation of passing\n2. **Most Common Mistake:** Rushing the technique instead of trusting the process\n3. **Best Opportunity Signal:** When you see the opening clearly and your body position is optimal - that's your moment\n\n### Cool-Down Protocol\n\n- Light stretching focusing on muscle groups used in passing\n- Breathing exercises for recovery (4-7-8 breathing pattern)\n- Mental reflection: What felt good? What needs work?\n- Hydration and nutrition within 30 minutes\n\n### Practice Homework\n\nHere's what I want you to work on before we meet again:\n\n**Daily Practice (10 minutes):**\n- 10 perfect repetitions of passing setup phase - focus on quality, not speed\n- Visualize passing execution in 3 different game scenarios\n- Watch video examples if available and identify the key moments\n\n**Mental Preparation:**\n- Before bed, mentally rehearse passing execution 5 times\n- See yourself succeeding, feel the movement, hear the sounds\n- This mental practice is as important as physical reps\n\n**Journal Prompt:**\nWrite down: \"The one thing that clicked for me today about passing was...\"\n\n\n\n---\n\n## Coach Notes & Adaptations\n\n**Safety Reminders:**\n- Monitor athletes for signs of fatigue - technique breaks down when tired\n- Ensure proper hydration throughout session\n- Watch for overexertion during live practice - ego can override good judgment\n\n**Individual Adaptations:**\n- Modify passing technique for different body types and athletic backgrounds\n- Adjust intensity based on experience level - push, don't break\n- Provide additional support for struggling athletes - everyone learns at their own pace\n\n**Assessment Criteria:**\n- Technical execution accuracy (form first, speed second)\n- Understanding of application principles (when to use it)\n- Ability to adapt under pressure (can they adjust mid-execution?)\n- Safety awareness and control (always)\n\n---\n\n**Final Word:**\n\npassing is not just a technique - it's a weapon you add to your arsenal. Master it through deliberate practice, understand it through competition, and refine it through constant feedback.\n\nRemember: Perfect practice makes perfect. See you at the next session.\n\n---\n\n*This lesson plan provides a comprehensive framework for mastering passing in bjj. Adjust timing and intensity based on individual needs and facility constraints. The goal is not just to teach the technique, but to develop athletes who think, adapt, and excel under pressure.*\n",
    "videoUrl": "https://firebasestorage.googleapis.com/v0/b/gameplan-787a2.firebasestorage.app/o/lesson-videos%2FOQuvoho6w3NC9QTBLFSoIK7A2RQ2%2F1760743579465_K92.mp4?alt=media&token=245b7d7f-6f30-40f9-99e7-c1c48601a19d",
    "createdAt": "2025-10-17T23:26:44.000Z",
    "publishedAt": "2025-10-17T23:26:44.000Z",
    "updatedAt": "2025-10-17T23:26:44.000Z"
  },
  {
    "id": "gRsebaBK7BwIq1Esq9SE",
    "title": "Football: Cover 3",
    "sport": "football",
    "level": "advanced",
    "duration": 45,
    "objectives": [
      "Execute Cover 3 techniques with proper form and timing",
      "Apply Cover 3 principles in competitive scenarios",
      "Understand the biomechanical foundations of Cover 3",
      "Integrate Cover 3 into overall football strategy"
    ],
    "sections": [
      {
        "id": "section-1760335619250-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for Cover 3.\n\n**Movement Preparation:**\n- Position-specific movement patterns\n- Acceleration and deceleration drills\n- Contact preparation exercises\n- Agility ladder work\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760335619250-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Execute Cover 3 technique in controlled reps\n- Focus on footwork and body positioning\n- Coach provides individual feedback on form\n\n**Drill 2: Resistance & Conditioning (3 minutes)**\n- Practice Cover 3 with resistance bands or against resistance\n- Build strength specific to the movement\n- Maintain proper form under increased load\n\n**Drill 3: Live Game Simulation (2 minutes)**\n- Execute Cover 3 in game-like scenarios\n- Add defensive pressure and game speed\n- Monitor for proper technique under competition conditions\n\n**Competition Simulation:**\nPractice Cover 3 in full-speed game situations with proper spacing, timing, and decision-making.",
        "order": 1,
        "duration": 8
      },
      {
        "id": "section-1760335619250-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper alignment and spacing based on formation\n- Check body position and balance for Cover 3\n- Verify field awareness and read defensive alignment\n- Ensure proper hand placement (if applicable) and footwork\n\n**Execution Phase:**\n1. Initial Movement: Begin with proper stance and footwork, ensuring your body position and field awareness are optimal for Cover 3 execution.\n2. Transition Point: Identify the optimal moment based on defensive alignment or play development that allows for Cover 3 execution.\n3. Force Application: Execute the movement with proper speed, power, and body control using correct football mechanics for Cover 3.\n4. Follow-Through: Complete the play with proper finish, maintaining balance and transitioning to the next play or defensive position.\n\n**Common Mistakes & Corrections:**\n❌ Poor initial stance → ✅ Establish proper three-point or two-point stance\n❌ Rushing the snap timing → ✅ Time your movement with the snap count\n❌ Losing field awareness → ✅ Keep your head on a swivel and read the play\n\n**Additional Focus:**\nCorners are 7 yards off the ball with deep third coverage. \nOutside linebackers have flats\nMiddle has hook to curl \nStrong safety has hook to curl \nFree safety has deep middle",
        "order": 2,
        "duration": 25
      },
      {
        "id": "section-1760335619250-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for Cover 3\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice Cover 3 technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      },
      {
        "id": "section-1760335724434",
        "title": "Watching your routes ",
        "type": "drill",
        "content": "Dont watch the Qb watch you routes and what comes in and out of your zone know where and when you’ll have help if you have multiple routes in your zone ",
        "order": 4,
        "duration": 0
      }
    ],
    "tags": [
      "football",
      "cover 3",
      "advanced",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "tgAXwLxXFWSm80yG5i5Mw3FRwts1",
    "creatorName": "Eleazar",
    "creatorEmail": "eleazarzaragozallanes@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T06:17:09.000Z",
    "publishedAt": "2025-10-13T06:17:09.000Z",
    "updatedAt": "2025-10-13T06:17:09.000Z"
  },
  {
    "id": "iCIojrh2q4vWbRtYxR2Q",
    "title": "Brazilian Jiu-Jitsu: The omaplata",
    "sport": "bjj",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute The omaplata techniques with proper form and timing",
      "Apply The omaplata principles in competitive scenarios",
      "Understand the biomechanical foundations of The omaplata",
      "Integrate The omaplata into overall bjj strategy"
    ],
    "sections": [
      {
        "id": "section-1760328538002-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for The omaplata.\n\n**Movement Preparation:**\n- Guard pulling and hip mobility drills\n- Bridging and shrimping movements\n- Grip strength activation\n- Core stability exercises\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760328538002-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper positioning relative to opponent/equipment\n- Check grip placement and pressure points\n- Verify foot positioning and weight distribution\n\n**Execution Phase:**\n1. Initial Movement: Begin with deliberate positioning, ensuring you have established the proper grip and stance for The omaplata execution in bjj.\n2. Transition Point: Identify the optimal moment when your opponent's balance or position allows for The omaplata application.\n3. Force Application: Apply controlled, progressive force using proper body mechanics and leverage principles specific to The omaplata.\n4. Follow-Through: Complete the movement with proper control and transition to advantageous position or next technique sequence.\n\n**Common Mistakes & Corrections:**\n❌ Rushing the setup phase → ✅ Take 2-3 seconds to establish proper positioning\n❌ Using excessive force early → ✅ Build pressure gradually through proper leverage\n❌ Neglecting opposite-side awareness → ✅ Maintain peripheral vision\n\n**Additional Focus:**\nThe omaplata is a shoulder lock using your legs. You trap one of your opponent’s arms with your legs and rotate your hips so their shoulder gets torqued. It can be finished as a submission or used to sweep and take the back.",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760328538002-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Partners alternate executing The omaplata technique\n- Focus on form over speed\n- Coach provides individual corrections\n\n**Drill 2: Resistance Training (3 minutes)**\n- Add progressive resistance to The omaplata execution\n- Build strength and muscle memory\n- Emphasize proper breathing under pressure\n\n**Drill 3: Live Application (2 minutes)**\n- Integrate The omaplata into free-form practice\n- Encourage experimentation with timing and setup\n- Monitor for safety and proper execution\n\n**Competition Simulation:**\nPractice The omaplata under competition-like conditions with time pressure scenarios and strategic decision making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760328538002-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for The omaplata\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice The omaplata technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      },
      {
        "id": "section-1760328541875",
        "title": "The omaplata",
        "type": "video",
        "content": "https://www.youtube.com/watch?v=F-3Jhm5oaIM&utm_source=chatgpt.com",
        "order": 4,
        "duration": 0
      }
    ],
    "tags": [
      "bjj",
      "the omaplata",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T04:09:41.000Z",
    "publishedAt": "2025-10-13T04:09:41.000Z",
    "updatedAt": "2025-10-13T04:09:41.000Z"
  },
  {
    "id": "mLy98CPMuywKJv9ykgGQ",
    "title": "TEST",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760088306857",
        "title": "",
        "type": "text",
        "content": "TETSTSTSTSTTSTSJHVGJHGJHGJHG",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T09:25:22.000Z",
    "publishedAt": "2025-10-10T09:25:22.000Z",
    "updatedAt": "2025-10-10T09:25:22.000Z"
  },
  {
    "id": "n7OXCdrKnWrccveIpLNr",
    "title": "TEST",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760156802743",
        "title": "TEST",
        "type": "text",
        "content": "THE TEST",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-11T04:26:56.000Z",
    "publishedAt": "2025-10-11T04:26:56.000Z",
    "updatedAt": "2025-10-11T04:26:56.000Z"
  },
  {
    "id": "pLIIrs2XkfF644bwKg8s",
    "title": "Brazilian Jiu-Jitsu: omaplata",
    "sport": "bjj",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute omaplata techniques with proper form and timing",
      "Apply omaplata principles in competitive scenarios",
      "Understand the biomechanical foundations of omaplata",
      "Integrate omaplata into overall bjj strategy"
    ],
    "sections": [
      {
        "id": "section-1760327979825-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for omaplata.\n\n**Movement Preparation:**\n- Guard pulling and hip mobility drills\n- Bridging and shrimping movements\n- Grip strength activation\n- Core stability exercises\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760327979825-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper positioning relative to opponent/equipment\n- Check grip placement and pressure points\n- Verify foot positioning and weight distribution\n\n**Execution Phase:**\n1. Initial Movement: Begin with deliberate positioning, ensuring you have established the proper grip and stance for omaplata execution in bjj.\n2. Transition Point: Identify the optimal moment when your opponent's balance or position allows for omaplata application.\n3. Force Application: Apply controlled, progressive force using proper body mechanics and leverage principles specific to omaplata.\n4. Follow-Through: Complete the movement with proper control and transition to advantageous position or next technique sequence.\n\n**Common Mistakes & Corrections:**\n❌ Rushing the setup phase → ✅ Take 2-3 seconds to establish proper positioning\n❌ Using excessive force early → ✅ Build pressure gradually through proper leverage\n❌ Neglecting opposite-side awareness → ✅ Maintain peripheral vision\n\n**Additional Focus:**\nThe omaplata is a shoulder lock using your legs. You trap one of your opponent’s arms with your legs and rotate your hips so their shoulder gets torqued. It can be finished as a submission or used to sweep and take the back.",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760327979825-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Partners alternate executing omaplata technique\n- Focus on form over speed\n- Coach provides individual corrections\n\n**Drill 2: Resistance Training (3 minutes)**\n- Add progressive resistance to omaplata execution\n- Build strength and muscle memory\n- Emphasize proper breathing under pressure\n\n**Drill 3: Live Application (2 minutes)**\n- Integrate omaplata into free-form practice\n- Encourage experimentation with timing and setup\n- Monitor for safety and proper execution\n\n**Competition Simulation:**\nPractice omaplata under competition-like conditions with time pressure scenarios and strategic decision making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760327979825-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for omaplata\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice omaplata technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      },
      {
        "id": "section-1760327999911",
        "title": "The Omaplata",
        "type": "video",
        "content": "",
        "order": 4,
        "duration": 0,
        "videoSource": "youtube",
        "videoUrl": "https://www.youtube.com/watch?v=QqMOkkI2KxU&utm_source=chatgpt.com"
      }
    ],
    "tags": [
      "bjj",
      "omaplata",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T04:00:58.000Z",
    "publishedAt": "2025-10-13T04:00:58.000Z",
    "updatedAt": "2025-10-13T04:00:58.000Z"
  },
  {
    "id": "qSgjjaTJ21ttIJFNvFTk",
    "title": "Brazilian Jiu-Jitsu: omaplata",
    "sport": "bjj",
    "level": "beginner",
    "duration": 45,
    "objectives": [
      "Execute omaplata techniques with proper form and timing",
      "Apply omaplata principles in competitive scenarios",
      "Understand the biomechanical foundations of omaplata",
      "Integrate omaplata into overall bjj strategy"
    ],
    "sections": [
      {
        "id": "section-1760327756280-0",
        "title": "Dynamic Warm-Up & Technical Foundation",
        "type": "text",
        "content": "Start with sport-specific movement patterns that activate the muscle groups essential for omaplata.\n\n**Movement Preparation:**\n- Guard pulling and hip mobility drills\n- Bridging and shrimping movements\n- Grip strength activation\n- Core stability exercises\n\n**Technical Foundation Review:**\n- Body Positioning: Proper stance, weight distribution, and alignment\n- Breathing Pattern: Coordinated breathing with movement execution\n- Mental Focus: Concentration points and awareness cues\n- Safety Protocols: Injury prevention and proper progression",
        "order": 0,
        "duration": 10
      },
      {
        "id": "section-1760327756280-1",
        "title": "Master-Level Technical Instruction",
        "type": "text",
        "content": "**Core Technique Breakdown**\n\n**Setup Phase:**\n- Establish proper positioning relative to opponent/equipment\n- Check grip placement and pressure points\n- Verify foot positioning and weight distribution\n\n**Execution Phase:**\n1. Initial Movement: Begin with deliberate positioning, ensuring you have established the proper grip and stance for omaplata execution in bjj.\n2. Transition Point: Identify the optimal moment when your opponent's balance or position allows for omaplata application.\n3. Force Application: Apply controlled, progressive force using proper body mechanics and leverage principles specific to omaplata.\n4. Follow-Through: Complete the movement with proper control and transition to advantageous position or next technique sequence.\n\n**Common Mistakes & Corrections:**\n❌ Rushing the setup phase → ✅ Take 2-3 seconds to establish proper positioning\n❌ Using excessive force early → ✅ Build pressure gradually through proper leverage\n❌ Neglecting opposite-side awareness → ✅ Maintain peripheral vision\n\n**Additional Focus:**\nThe omaplata is a shoulder lock using your legs. You trap one of your opponent’s arms with your legs and rotate your hips so their shoulder gets torqued. It can be finished as a submission or used to sweep and take the back.",
        "order": 1,
        "duration": 25
      },
      {
        "id": "section-1760327756280-2",
        "title": "Progressive Practice & Live Application",
        "type": "drill",
        "content": "**Drill 1: Technical Repetition (3 minutes)**\n- Partners alternate executing omaplata technique\n- Focus on form over speed\n- Coach provides individual corrections\n\n**Drill 2: Resistance Training (3 minutes)**\n- Add progressive resistance to omaplata execution\n- Build strength and muscle memory\n- Emphasize proper breathing under pressure\n\n**Drill 3: Live Application (2 minutes)**\n- Integrate omaplata into free-form practice\n- Encourage experimentation with timing and setup\n- Monitor for safety and proper execution\n\n**Competition Simulation:**\nPractice omaplata under competition-like conditions with time pressure scenarios and strategic decision making.",
        "order": 2,
        "duration": 8
      },
      {
        "id": "section-1760327756280-3",
        "title": "Cool-Down & Review",
        "type": "reflection",
        "content": "**Key Points Review:**\n- Primary execution cues for omaplata\n- Most common mistake to avoid\n- Best setup opportunities\n\n**Cool-Down Protocol:**\n- Light stretching focusing on muscle groups used\n- Breathing exercises for recovery\n- Mental reflection on lesson key points\n\n**Homework Assignment:**\nPractice omaplata technique:\n- 10 repetitions daily focusing on setup phase\n- Visualize competition applications\n- Review video examples if available",
        "order": 3,
        "duration": 2
      },
      {
        "id": "section-1760327762657",
        "title": "",
        "type": "video",
        "content": "",
        "order": 4,
        "duration": 0,
        "videoSource": "youtube",
        "videoUrl": "https://youtu.be/F-3Jhm5oaIM?si=0ALPuD7d9Fl_NqZY"
      }
    ],
    "tags": [
      "bjj",
      "omaplata",
      "beginner",
      "technique"
    ],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-13T03:57:13.000Z",
    "publishedAt": "2025-10-13T03:57:13.000Z",
    "updatedAt": "2025-10-13T03:57:13.000Z"
  },
  {
    "id": "wgDZwMn1fxP0YFpwx8Ig",
    "title": "Cross Collar Choke from Closed Guard (fundamental gi choke)",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760131879169",
        "title": "Cross Collar Choke",
        "type": "text",
        "content": "Goal: Secure two deep collar grips and use torque and body mechanics to create a high-percentage choke from closed guard.\n\nWhy we train it\n\nThe cross collar choke is a core submission in gi Jiu Jitsu. It teaches grip fighting, posture breaking, and subtle body mechanics rather than brute strength.\n\nStep-by-step mechanics\n\nInitial grips and posture break\n\nFrom closed guard, control one sleeve or the back of the wrist with one hand to prevent posture.\n\nBreak posture with hip drive, pulling them forward with feet on hips or one foot on the hip and the other hooking the hip.\n\nEstablish the first collar grip\n\nWith your dominant hand, reach deep into the opponent’s collar on the far side. Your thumb should be tucked in and the blade of your hand inside the collar, palm toward you.\n\nPull the collar across their neck to flatten them.\n\nSet the second grip (crossing hand)\n\nWith your other hand, reach under and grab the opposite collar, again deep, so the fingers can pull the collar across. The grips should form an X across the neck when both are pulled.\n\nYour elbows should be low and close to your ribs so the chokepath is horizontal across the carotid arteries.\n\nFinish mechanics\n\nSqueeze and rotate your torso while pulling both hands in opposite directions. Use your shoulders and back, not biceps.\n\nFor added leverage, expand your guard slightly and use your shin to push on their ribs or hip to prevent their bridge escape.\n\nOptionally, sit up slightly and use your legs to rotate their head for a quicker finish.\n\nVariations and set-ups\n\nCross collar to armbar: If they posture and defend the choke, switch to an armbar by isolating the wrist and swinging the leg over.\n\nCross collar with hip bump sweep: Break posture, set collar, bump to side sweep as they react, and tighten choke once on top.\n\nDrills and repetitions\n\nGrip entry drill: 5 slow reps where you focus only on deep collar grips, no finish.\n\nTiming drill: Partner resists posture; you break and immediately set cross-collar, 6 reps each side.\n\nLive guard rounds: Start with closed guard and attempt cross collar or transitions for 3-minute rounds.\n\nCommon mistakes and corrections\n\nShallow grips: Collar must be deep. Correction: slide your hand as far up the collar as possible with thumb in.\n\nUsing arms only: The finish should use torso rotation. Correction: rotate chest and pull with shoulder blades.\n\nLeaving elbows high: This creates space. Correction: keep elbows tight and hug the opponent’s upper chest.\n\nCoaching cues\n\n“Two deep grips, elbows in, rotate your chest.”\n\n“Pull collar to collar, don’t yank with your biceps.”\n\n“Use your hips to break posture before you take the grips.”\n\nSafety and training hygiene\n\nTap early; when partner taps, release immediately.\n\nDrill the finish slowly at first. Build speed only after the grip pathways are automatic.\n\nWarm up ankles, knees, and neck before drilling takedowns and chokes.\n\nFor chokes, practice from the bottom and top so both partners understand the feeling and when to tap.\n\nSuggested week plan (how to train these)\n\nDay 1: Warm-up, 20 minutes drilling single leg entries and finishes, 20 minutes positional sparring (standing entries) and 10 minutes cool down.\n\nDay 2: Warm-up, 25 minutes leg drag sequences and passing, 20 minutes situational rolling starting in guard, finish with 10 minutes technique review.\n\nDay 3: Warm-up, 30 minutes cross collar grip drills and finishing, 20 minutes live guard rounds with focus on submissions, short mobility cool down.",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T21:31:40.000Z",
    "publishedAt": "2025-10-10T21:31:40.000Z",
    "updatedAt": "2025-10-10T21:31:40.000Z"
  },
  {
    "id": "xJQ3bDDHCXARWubLxuoM",
    "title": "Cross Collar Choke",
    "sport": "bjj",
    "level": "beginner",
    "duration": 60,
    "objectives": [],
    "sections": [
      {
        "id": "section-1760084608347",
        "title": "Cross Collar Choke",
        "type": "text",
        "content": "Goal: Secure two deep collar grips and use torque and body mechanics to create a high-percentage choke from closed guard.\n\nWhy we train it\nThe cross collar choke is a core submission in gi Jiu Jitsu. It teaches grip fighting, posture breaking, and subtle body mechanics rather than brute strength.\n\nStep-by-step mechanics\nInitial grips and posture break\n\nFrom closed guard, control one sleeve or the back of the wrist with one hand to prevent posture.\n\nBreak posture with hip drive, pulling them forward with feet on hips or one foot on the hip and the other hooking the hip.\n\nEstablish the first collar grip\n\nWith your dominant hand, reach deep into the opponent’s collar on the far side. Your thumb should be tucked in and the blade of your hand inside the collar, palm toward you.\n\nPull the collar across their neck to flatten them.\n\nSet the second grip (crossing hand)\n\nWith your other hand, reach under and grab the opposite collar, again deep, so the fingers can pull the collar across. The grips should form an X across the neck when both are pulled.\n\nYour elbows should be low and close to your ribs so the chokepath is horizontal across the carotid arteries.\n\nFinish mechanics\n\nSqueeze and rotate your torso while pulling both hands in opposite directions. Use your shoulders and back, not biceps.\n\nFor added leverage, expand your guard slightly and use your shin to push on their ribs or hip to prevent their bridge escape.\n\nOptionally, sit up slightly and use your legs to rotate their head for a quicker finish.\n\nVariations and set-ups\nCross collar to armbar: If they posture and defend the choke, switch to an armbar by isolating the wrist and swinging the leg over.\n\nCross collar with hip bump sweep: Break posture, set collar, bump to side sweep as they react, and tighten choke once on top.\n\nDrills and repetitions\nGrip entry drill: 5 slow reps where you focus only on deep collar grips, no finish.\n\nTiming drill: Partner resists posture; you break and immediately set cross-collar, 6 reps each side.\n\nLive guard rounds: Start with closed guard and attempt cross collar or transitions for 3-minute rounds.\n\nCommon mistakes and corrections\nShallow grips: Collar must be deep. Correction: slide your hand as far up the collar as possible with thumb in.\n\nUsing arms only: The finish should use torso rotation. Correction: rotate chest and pull with shoulder blades.\n\nLeaving elbows high: This creates space. Correction: keep elbows tight and hug the opponent’s upper chest.\n\nCoaching cues\n“Two deep grips, elbows in, rotate your chest.”\n\n“Pull collar to collar, don’t yank with your biceps.”\n\n“Use your hips to break posture before you take the grips.”\n\nSafety and training hygiene\nTap early; when partner taps, release immediately.\n\nDrill the finish slowly at first. Build speed only after the grip pathways are automatic.\n\nWarm up ankles, knees, and neck before drilling takedowns and chokes.\n\nFor chokes, practice from the bottom and top so both partners understand the feeling and when to tap.\n\nSuggested week plan (how to train these)\nDay 1: Warm-up, 20 minutes drilling single leg entries and finishes, 20 minutes positional sparring (standing entries) and 10 minutes cool down.\n\nDay 2: Warm-up, 25 minutes leg drag sequences and passing, 20 minutes situational rolling starting in guard, finish with 10 minutes technique review.\n\nDay 3: Warm-up, 30 minutes cross collar grip drills and finishing, 20 minutes live guard rounds with focus on submissions, short mobility cool down.",
        "order": 0,
        "duration": 0
      }
    ],
    "tags": [],
    "visibility": "athletes_only",
    "creatorUid": "OQuvoho6w3NC9QTBLFSoIK7A2RQ2",
    "creatorName": "Joseph Llanes",
    "creatorEmail": "llanes.joseph.m@gmail.com",
    "status": "published",
    "viewCount": 0,
    "completionCount": 0,
    "averageRating": 0,
    "ratingCount": 0,
    "createdAt": "2025-10-10T08:23:54.000Z",
    "publishedAt": "2025-10-10T08:23:54.000Z",
    "updatedAt": "2025-10-10T08:23:54.000Z"
  }
]